[
  {
    "text": "This is an episode that's been almost one year in the making,",
    "start": 0.0,
    "duration": 3.6
  },
  {
    "text": "the theolocution of Donald Hoffman and Joscha Bach,",
    "start": 3.6,
    "duration": 3.6
  },
  {
    "text": "both of whom should be extremely familiar to you if you've surveyed this channel before,",
    "start": 7.2,
    "duration": 4.24
  },
  {
    "text": "as we've done an unduly technical dive into Donald Hoffman's research papers,",
    "start": 11.44,
    "duration": 4.16
  },
  {
    "text": "and we've spoken to Joscha Bach several times before as well.",
    "start": 15.6,
    "duration": 3.28
  },
  {
    "text": "If you're unfamiliar, Donald Hoffman is a professor at the University of Irvine, California,",
    "start": 18.88,
    "duration": 5.04
  },
  {
    "text": "studying consciousness and evolutionary psychology using mathematical models,",
    "start": 23.92,
    "duration": 4.08
  },
  {
    "text": "and Joscha Bach is a cognitive scientist recognized in the field of AI as being exceptionally ingenious.",
    "start": 28.0,
    "duration": 6.16
  },
  {
    "text": "Both have unexampled views of consciousness and free will,",
    "start": 34.16,
    "duration": 3.52
  },
  {
    "text": "which harmonize and contradict in prepossessing and informative ways.",
    "start": 37.68,
    "duration": 3.84
  },
  {
    "text": "Click on the timestamp in the description if you'd like to skip this intro.",
    "start": 41.52,
    "duration": 3.28
  },
  {
    "text": "My name is Curt Jaimungal, I'm a Torontonian filmmaker with a background in mathematical",
    "start": 44.8,
    "duration": 4.96
  },
  {
    "text": "physics dedicated to the explication of the variegated terrain of theories of everything,",
    "start": 49.76,
    "duration": 5.44
  },
  {
    "text": "from a theoretical physics perspective, but as well as analyzing consciousness and",
    "start": 55.2,
    "duration": 4.4
  },
  {
    "text": "seeing its potential connection to fundamental reality, whatever that is.",
    "start": 59.6,
    "duration": 3.92
  },
  {
    "text": "Essentially, this channel is dedicated to exploring the underrived nature of reality,",
    "start": 63.52,
    "duration": 4.48
  },
  {
    "text": "the constitutional laws that govern it, provided those laws exist at all and are even knowable to us.",
    "start": 68.0,
    "duration": 4.8
  },
  {
    "text": "If you enjoy witnessing and engaging with others on the topics of psychology,",
    "start": 72.8,
    "duration": 4.24
  },
  {
    "text": "consciousness, physics, etc., the channel's themes,",
    "start": 77.04,
    "duration": 3.12
  },
  {
    "text": "then do consider going to the Discord and the subreddit, which are linked in the description.",
    "start": 80.16,
    "duration": 4.32
  },
  {
    "text": "There's also a link to the Patreon, that is patreon.com slash CURTJAIMUNGAL,",
    "start": 84.48,
    "duration": 4.4
  },
  {
    "text": "if you'd like to support this podcast, as the patrons and the sponsors are the only reasons",
    "start": 88.88,
    "duration": 4.48
  },
  {
    "text": "that I'm able to have podcasts of this quality and this depth, given that I can do this now",
    "start": 93.36,
    "duration": 5.04
  },
  {
    "text": "full-time, thanks to both the patrons and the sponsors' support.",
    "start": 98.4,
    "duration": 3.2
  },
  {
    "text": "Speaking of sponsors, there are two. The first sponsor is Brilliant.",
    "start": 101.6,
    "duration": 3.68
  },
  {
    "text": "During the winter break, I decided to brush up on some of the fundamentals of physics,",
    "start": 105.28,
    "duration": 3.68
  },
  {
    "text": "particularly with regard to information theory, as I'd like to interview Chiara Marletto on",
    "start": 108.96,
    "duration": 4.72
  },
  {
    "text": "constructor theory, which is heavily based in information theory.",
    "start": 113.68,
    "duration": 3.04
  },
  {
    "text": "Now, information theory is predicated on entropy, at least there's a fundamental formula for entropy.",
    "start": 116.72,
    "duration": 4.56
  },
  {
    "text": "So I ended up taking the Brilliant course. I challenged myself to do one lesson per day,",
    "start": 121.28,
    "duration": 4.32
  },
  {
    "text": "and I took the courses Random Variable Distributions and Knowledge slash Uncertainty.",
    "start": 125.6,
    "duration": 4.56
  },
  {
    "text": "What I loved is that despite knowing the formula for entropy, which is essentially",
    "start": 130.16,
    "duration": 3.68
  },
  {
    "text": "hammered into you as an undergraduate, it seems like it comes down from the sky arbitrarily.",
    "start": 133.84,
    "duration": 4.96
  },
  {
    "text": "And with Brilliant, for the first time, I was able to see how the formula for entropy,",
    "start": 138.8,
    "duration": 3.76
  },
  {
    "text": "which you're seeing right now, is actually extremely natural,",
    "start": 142.56,
    "duration": 2.88
  },
  {
    "text": "and it'd be strange to define it in any other manner.",
    "start": 145.44,
    "duration": 2.32
  },
  {
    "text": "There are plenty of courses, and you can even learn group theory,",
    "start": 147.76,
    "duration": 3.04
  },
  {
    "text": "which is what's being referenced when you hear that the standard model is predicated on U1",
    "start": 150.8,
    "duration": 3.92
  },
  {
    "text": "cross SU2 cross SU3. Those are Lie groups, continuous Lie groups.",
    "start": 154.72,
    "duration": 3.68
  },
  {
    "text": "Visit brilliant.org slash TOE, T-O-E, to get 20% off an annual subscription.",
    "start": 158.4,
    "duration": 5.12
  },
  {
    "text": "And I recommend that you don't stop before four lessons. I think you'll be greatly surprised at",
    "start": 163.52,
    "duration": 4.56
  },
  {
    "text": "the ease at which you can now comprehend subjects you previously had a difficult time grokking.",
    "start": 168.08,
    "duration": 4.72
  },
  {
    "text": "The second sponsor is Algo. Now, Algo is an end-to-end supply chain optimization software",
    "start": 172.8,
    "duration": 5.28
  },
  {
    "text": "company with software that helps business users optimize sales and operations,",
    "start": 178.08,
    "duration": 4.56
  },
  {
    "text": "planning to avoid stockouts, reduce return and inventory write downs while reducing",
    "start": 182.64,
    "duration": 4.48
  },
  {
    "text": "inventory investment. It's a supply chain AI that drives smart ROI, headed by Amjad Hussain,",
    "start": 187.12,
    "duration": 6.0
  },
  {
    "text": "who's been a huge supporter of this podcast since near its inception. In fact, Amjad has his own",
    "start": 193.12,
    "duration": 5.52
  },
  {
    "text": "podcast on AI and consciousness and business growth. And if you'd like to support the TOE podcast,",
    "start": 198.64,
    "duration": 5.28
  },
  {
    "text": "then visit the link in the description to see Amjad's podcast because subscribing to him,",
    "start": 203.92,
    "duration": 4.56
  },
  {
    "text": "or at least visiting, supports the TOE podcast indirectly. Thank you and enjoy.",
    "start": 208.48,
    "duration": 4.64
  },
  {
    "text": "Okay, this should be live. If you can see this, type in Animaniacs into the chat. Animaniacs.",
    "start": 213.76,
    "duration": 6.96
  },
  {
    "text": "Great. There are already 275 people watching. Firstly, it's a distinct honor to be here.",
    "start": 221.68,
    "duration": 6.08
  },
  {
    "text": "Thank you both, Don and Joscha. I appreciate it tremendously and the audience does as well.",
    "start": 227.76,
    "duration": 5.36
  },
  {
    "text": "This theories of everything project is about exploring grand unified theories and theoretical",
    "start": 233.12,
    "duration": 6.08
  },
  {
    "text": "physics, as you know, and understanding consciousness and free will. I see those,",
    "start": 239.2,
    "duration": 3.68
  },
  {
    "text": "or at least intuit that those are integrally tied. And it's those, the latter two topics that bring us",
    "start": 242.88,
    "duration": 5.84
  },
  {
    "text": "here. Don, why don't we start with your definition of free will as well as how you view consciousness.",
    "start": 248.72,
    "duration": 5.92
  },
  {
    "text": "And you mentioned that you would like to give an overview of your point of view on science and",
    "start": 254.64,
    "duration": 4.88
  },
  {
    "text": "theories of everything in general. And then Joscha, you'll join afterward and commend Donald or amend",
    "start": 259.52,
    "duration": 7.6
  },
  {
    "text": "him. And then I'll pretty much shut my mouth and allow you both to speak to one another",
    "start": 267.12,
    "duration": 3.76
  },
  {
    "text": "interjecting only seldom. Okay. Thank you, Curt. And good to see you, Joscha.",
    "start": 270.88,
    "duration": 5.76
  },
  {
    "text": "My attitude about science is sort of like what Newton famously said, right? He said",
    "start": 278.0,
    "duration": 8.64
  },
  {
    "text": "that toward the end of his career, that he thought of himself as like a little boy playing on the",
    "start": 286.64,
    "duration": 7.12
  },
  {
    "text": "seashore, looking at some nice pebbles and shells while all before him lay the vast ocean of",
    "start": 293.76,
    "duration": 9.2
  },
  {
    "text": "truth that was undiscovered. And I think that that's a good attitude for us as scientists",
    "start": 302.96,
    "duration": 8.48
  },
  {
    "text": "to have is that as much as we've done, we've really not even begun to explore the possibilities",
    "start": 311.44,
    "duration": 10.56
  },
  {
    "text": "of truth. And what's interesting is that Newton's followers famously didn't follow him on that.",
    "start": 322.0,
    "duration": 7.76
  },
  {
    "text": "In the late 19th century, a lot of Newtonians thought that it was pretty much over. They had",
    "start": 330.48,
    "duration": 4.96
  },
  {
    "text": "a theory of everything. There were a few little wrinkles. There was the problem of Michelson-Morley",
    "start": 335.44,
    "duration": 7.68
  },
  {
    "text": "experiment and blackbody radiation wasn't quite working out according to Newton, but they thought",
    "start": 343.12,
    "duration": 5.68
  },
  {
    "text": "that that was pretty minor stuff and they would figure that all out and physics was pretty much",
    "start": 348.8,
    "duration": 4.32
  },
  {
    "text": "done. And we've discovered that no, physics was hardly beginning. There was so much more",
    "start": 353.12,
    "duration": 7.28
  },
  {
    "text": "to discover. And so my attitude is that science cannot have a theory of everything in principle,",
    "start": 360.4,
    "duration": 9.6
  },
  {
    "text": "that we will always be on Newton's seashore. We'll always be like Newton, the little boy",
    "start": 371.44,
    "duration": 6.16
  },
  {
    "text": "playing with pebbles and shells while the vast truth lays undiscovered before us,",
    "start": 377.6,
    "duration": 6.56
  },
  {
    "text": "the ocean of truth. And it's for a principled reason that scientific theories, if you look at",
    "start": 384.16,
    "duration": 7.2
  },
  {
    "text": "how they're structured, we start with a good scientific theory, tells you exactly what its",
    "start": 391.36,
    "duration": 5.52
  },
  {
    "text": "assumptions are. This is what I'm assuming. These are the derivation rules that I allow.",
    "start": 396.88,
    "duration": 5.44
  },
  {
    "text": "And then everything about the theory follows from that. But that theory doesn't explain its",
    "start": 402.88,
    "duration": 5.84
  },
  {
    "text": "assumptions. The assumptions are what's assumed. So Einstein in his special theory of relativity",
    "start": 408.72,
    "duration": 6.56
  },
  {
    "text": "assumes that light travels at the same speed for all observers in all inertial reference frames.",
    "start": 415.28,
    "duration": 6.72
  },
  {
    "text": "But that theory doesn't tell you what light is. And in fact, Einstein spent his whole life",
    "start": 422.8,
    "duration": 5.52
  },
  {
    "text": "wondering what light is and toward the end of his life said, I've spent my whole life studying it",
    "start": 428.32,
    "duration": 3.76
  },
  {
    "text": "and I still have no idea what light really is. And so we're in that situation as scientists where",
    "start": 432.08,
    "duration": 7.28
  },
  {
    "text": "what we're doing is valuable. It's absolutely essential because we're being precise about our",
    "start": 440.32,
    "duration": 4.96
  },
  {
    "text": "assumptions. We're being precise about what they entail. But there's going to be a fundamental",
    "start": 445.28,
    "duration": 5.68
  },
  {
    "text": "limit. And my guess is that science, as valuable as it is, is one of the most important advances",
    "start": 450.96,
    "duration": 8.64
  },
  {
    "text": "that humanity has made, will always and only scratch the surface beyond the seashore with",
    "start": 459.6,
    "duration": 6.72
  },
  {
    "text": "Newton while the vast ocean lays undiscovered. So when we talk about theories of consciousness",
    "start": 466.32,
    "duration": 8.0
  },
  {
    "text": "and free will and so forth going forward, I do it with sort of a very modest look at my own ideas.",
    "start": 474.32,
    "duration": 8.4
  },
  {
    "text": "The ideas are going to be very much in the framework of these are the best ideas we've",
    "start": 482.72,
    "duration": 6.24
  },
  {
    "text": "come up with so far. Of course, there's going to be much, much deeper work ahead and much more to",
    "start": 488.96,
    "duration": 7.36
  },
  {
    "text": "discover ahead. So we just have to, as scientists, be precise about the current assumptions we're",
    "start": 496.32,
    "duration": 5.44
  },
  {
    "text": "making and why we're making them and what follows from them, but be completely open to radical",
    "start": 501.76,
    "duration": 6.16
  },
  {
    "text": "transformations in knowledge and radical new understandings.",
    "start": 508.72,
    "duration": 3.28
  },
  {
    "text": "Your view on consciousness and free will.",
    "start": 513.2,
    "duration": 1.84
  },
  {
    "text": "So in a nutshell, my views on consciousness are not physicalist. So",
    "start": 515.04,
    "duration": 12.96
  },
  {
    "text": "physicalist approaches will say that we will start with space-time and some of its contents,",
    "start": 530.56,
    "duration": 6.72
  },
  {
    "text": "particles, neurons, neural systems, neural networks.",
    "start": 537.92,
    "duration": 3.44
  },
  {
    "text": "And those will be, so that's a scientific theory in which those are our assumptions.",
    "start": 543.52,
    "duration": 4.72
  },
  {
    "text": "Space-time and its contents are fundamental and particular contents may be very, very important.",
    "start": 548.24,
    "duration": 5.44
  },
  {
    "text": "For example, dynamical systems on neural networks, for example. And from that, we're going to try to",
    "start": 553.68,
    "duration": 8.32
  },
  {
    "text": "boot up subjective experience. And that's perfectly a fine project to try to do. What I",
    "start": 562.0,
    "duration": 8.96
  },
  {
    "text": "would want from that physicalist approach would be not a hand wave, but a specific accomplishment.",
    "start": 570.96,
    "duration": 6.88
  },
  {
    "text": "So how do we start with dynamical systems of neural networks and come up with the taste of chocolate",
    "start": 577.84,
    "duration": 8.16
  },
  {
    "text": "or the smell of garlic or something specific? Some specific conscious experience where we say,",
    "start": 586.56,
    "duration": 5.44
  },
  {
    "text": "my scientific theory says why this dynamical system of activity in neurons or in computer",
    "start": 592.96,
    "duration": 7.12
  },
  {
    "text": "system or something like that must be the taste of chocolate. It could not be the smell of garlic.",
    "start": 600.08,
    "duration": 4.16
  },
  {
    "text": "And these are the principled reasons why. If something like that were on the table,",
    "start": 604.24,
    "duration": 3.76
  },
  {
    "text": "I would be impressed. Until then, I'm not impressed. And there's nothing on the table",
    "start": 608.0,
    "duration": 6.0
  },
  {
    "text": "yet that can do that. So that's one reason why I've been casting around and looking for a",
    "start": 614.56,
    "duration": 6.64
  },
  {
    "text": "different direction. It's not starting with the physical, but starting somewhere else.",
    "start": 621.2,
    "duration": 7.68
  },
  {
    "text": "And partly because, and we can talk about this in greater detail,",
    "start": 628.88,
    "duration": 3.36
  },
  {
    "text": "because our best scientific theories right now, namely",
    "start": 634.08,
    "duration": 2.96
  },
  {
    "text": "quantum field theory and general relativity on the one hand, and evolution of natural selection",
    "start": 638.0,
    "duration": 6.4
  },
  {
    "text": "on the other, both entail that space-time is not fundamental. Our two or three premier scientific",
    "start": 644.4,
    "duration": 11.52
  },
  {
    "text": "theories really tell us their limits. They tell us that space-time cannot be fundamental.",
    "start": 655.92,
    "duration": 7.04
  },
  {
    "text": "And so if we're going to look for a theory of consciousness,",
    "start": 663.04,
    "duration": 2.64
  },
  {
    "text": "and we start with something inside space-time, we're already starting where our best scientific",
    "start": 667.52,
    "duration": 5.12
  },
  {
    "text": "theories tell us it's not fundamental. So as a result, I've been trying to then say, well,",
    "start": 672.64,
    "duration": 6.96
  },
  {
    "text": "if space-time isn't fundamental and we don't yet know what's more fundamental,",
    "start": 679.6,
    "duration": 4.4
  },
  {
    "text": "then we're going to have to look for a theory of consciousness. And I think that's a good",
    "start": 684.88,
    "duration": 4.56
  },
  {
    "text": "example. If space-time is not fundamental and we don't yet know what's more fundamental,",
    "start": 689.44,
    "duration": 5.44
  },
  {
    "text": "why don't we first start with trying to get a mathematical theory of consciousness on its own",
    "start": 695.44,
    "duration": 5.6
  },
  {
    "text": "terms? What is consciousness? What kinds of assumptions can we make about it? And then we",
    "start": 701.04,
    "duration": 6.0
  },
  {
    "text": "can ask the question, is consciousness more fundamental than space-time? What is the",
    "start": 707.04,
    "duration": 5.68
  },
  {
    "text": "time? So, and I can go in some of the details if we want to on that model, but the big picture is",
    "start": 712.88,
    "duration": 10.08
  },
  {
    "text": "that I'm taking very seriously that evolution of a natural selection entails that none of our",
    "start": 722.96,
    "duration": 7.68
  },
  {
    "text": "sensory systems tell us the truth about objective reality, and that therefore space-time is not an",
    "start": 731.36,
    "duration": 6.0
  },
  {
    "text": "objective truth, it's just a representation of fitness payoffs. And that physicists are finding",
    "start": 737.36,
    "duration": 8.4
  },
  {
    "text": "the same thing that Nima Arkani-Hamed, for example, at the Institute for Advanced Study at Princeton,",
    "start": 745.76,
    "duration": 5.2
  },
  {
    "text": "basically has lectures where he says space-time is doomed and here's why. And the best physicists",
    "start": 750.96,
    "duration": 5.44
  },
  {
    "text": "are now trying to figure out what's next. Space-time has had a good run for several centuries",
    "start": 756.4,
    "duration": 4.72
  },
  {
    "text": "and it's over. Space-time is not fundamental and the contents of space-time are not fundamental.",
    "start": 761.12,
    "duration": 5.44
  },
  {
    "text": "And so we need to figure out, and he's got things, working with Juan Maldacena on things like",
    "start": 766.56,
    "duration": 4.4
  },
  {
    "text": "cosmological polytopes, they're finding structures beyond space-time from which space-time can emerge",
    "start": 770.96,
    "duration": 6.08
  },
  {
    "text": "as a projection, as a special case. But in these deeper theories, there is no time",
    "start": 777.04,
    "duration": 7.92
  },
  {
    "text": "and there is no space. But there are symmetries that are true of, for example, scattering",
    "start": 785.6,
    "duration": 5.12
  },
  {
    "text": "amplitudes data, that are true, that you can't see in space-time. They can predict the data,",
    "start": 790.72,
    "duration": 7.44
  },
  {
    "text": "but they don't use space and time as the fundamental concepts. And I think that as we start to go into",
    "start": 798.16,
    "duration": 7.36
  },
  {
    "text": "scientific theories of consciousness, we cannot ignore what our physicist colleagues are telling",
    "start": 806.64,
    "duration": 5.44
  },
  {
    "text": "us. They're telling us if you're looking for something fundamental, it's not space-time,",
    "start": 812.08,
    "duration": 4.8
  },
  {
    "text": "and in particular, it's not time. And that is a real showstopper. It's for the physicists too. I",
    "start": 816.88,
    "duration": 6.64
  },
  {
    "text": "mean, trying to think outside of the time box is not easy for the physicists. And so what do we do",
    "start": 823.52,
    "duration": 6.96
  },
  {
    "text": "if we don't have space-time, if we don't have time? So I think that that's one of the interesting",
    "start": 830.48,
    "duration": 7.84
  },
  {
    "text": "questions that we have to face. If we're going to come up with a theory of consciousness,",
    "start": 838.32,
    "duration": 3.52
  },
  {
    "text": "what do we take as fundamental in our theory? If we take anything inside space-time,",
    "start": 841.84,
    "duration": 4.96
  },
  {
    "text": "we're already sort of cutting ourselves off because we know that as physics progresses,",
    "start": 847.36,
    "duration": 6.56
  },
  {
    "text": "things inside space-time will just be shown to be secondary. So we can go into my details on",
    "start": 854.48,
    "duration": 7.2
  },
  {
    "text": "my current model of consciousness, but maybe we should talk first about the more meta ideas.",
    "start": 862.64,
    "duration": 4.32
  },
  {
    "text": "Sure. And Josje, please.",
    "start": 867.92,
    "duration": 2.0
  },
  {
    "text": "It's interesting that you start outing yourself as a",
    "start": 872.8,
    "duration": 2.88
  },
  {
    "text": "mysterionist in a way, right? The mysterionism being the position that human minds are basically",
    "start": 876.24,
    "duration": 4.56
  },
  {
    "text": "not equipped to understand how they work or how the universe works, that they're embedded in at a",
    "start": 880.8,
    "duration": 5.36
  },
  {
    "text": "very deep level. And I sometimes joke that mysterionism is the position that something",
    "start": 886.16,
    "duration": 5.12
  },
  {
    "text": "cannot be understood if it cannot be understood by Noam Chomsky.",
    "start": 891.28,
    "duration": 2.96
  },
  {
    "text": "Noam Chomsky is a mysterious with respect to the mind. At the Science of Consciousness",
    "start": 895.04,
    "duration": 4.4
  },
  {
    "text": "conference, he once gave a presentation where he talks about Descartes and then mentions that",
    "start": 899.44,
    "duration": 6.64
  },
  {
    "text": "Descartes was actually a very smart fellow because he could already anticipate stuff that would only",
    "start": 906.08,
    "duration": 4.96
  },
  {
    "text": "be discovered much, much later on. And I was perking up and wondering, my God, Chomsky is",
    "start": 911.04,
    "duration": 5.52
  },
  {
    "text": "giving this guy credit. And it turned out what he anticipated was that he was actually a very smart",
    "start": 916.56,
    "duration": 5.68
  },
  {
    "text": "fellow. And it turned out what he anticipated was that we would later, like Chomsky, discover that",
    "start": 922.24,
    "duration": 4.8
  },
  {
    "text": "the mind is unintelligible. Right? So, it's fascinating, of course, if you are one of the",
    "start": 927.04,
    "duration": 7.84
  },
  {
    "text": "smartest minds of your own generation and you see that other people don't understand things that you",
    "start": 934.88,
    "duration": 6.88
  },
  {
    "text": "understand. And there is a boundary where nobody seems to have an understanding and you crash",
    "start": 941.76,
    "duration": 4.4
  },
  {
    "text": "against it. You might think, okay, maybe there is no way that humans can do it. Not convinced that",
    "start": 946.16,
    "duration": 5.84
  },
  {
    "text": "the case is. I'm not a mysterianist at this point in my intellectual career. And it's in part because",
    "start": 952.32,
    "duration": 6.48
  },
  {
    "text": "I come from the other side. So, many of the things that people took as a given for a long time, like",
    "start": 958.8,
    "duration": 6.88
  },
  {
    "text": "space and time, appeared to me in the beginning quite mysterious. So, basically, the dissolution",
    "start": 965.68,
    "duration": 8.32
  },
  {
    "text": "of space and time was not that mysterious to me. Basically, I'm a computer scientist. I started",
    "start": 974.0,
    "duration": 6.0
  },
  {
    "text": "very, very early on in my life to program before I properly understood mathematics and before I",
    "start": 980.0,
    "duration": 5.92
  },
  {
    "text": "understood physics. And I understood how to make things in a computer. And Einstein's watch that",
    "start": 985.92,
    "duration": 7.28
  },
  {
    "text": "is ticking away and you can observe its movements and so on, but you cannot open it and you can come",
    "start": 993.2,
    "duration": 8.08
  },
  {
    "text": "up with theories what's happening inside. To me, this watch was the screen of a computer.",
    "start": 1001.28,
    "duration": 4.64
  },
  {
    "text": "And I understood that there is no limit to what can be put into the computer if it has enough",
    "start": 1006.8,
    "duration": 6.32
  },
  {
    "text": "resources. So, if the computer is fast enough and has enough memory, there is no pattern that cannot",
    "start": 1013.12,
    "duration": 5.12
  },
  {
    "text": "be shown on the screen. There is no limit to the sequence of patterns that is to be shown on the",
    "start": 1018.24,
    "duration": 4.24
  },
  {
    "text": "screen. So, any observation that I am making, if I understand it as a pattern on some kind of screen",
    "start": 1022.48,
    "duration": 6.72
  },
  {
    "text": "that is visible to me, I will always be able to construct something, a mechanism that is on the",
    "start": 1029.2,
    "duration": 5.68
  },
  {
    "text": "other side and produces the sequence. And now the question is, can I produce an elegant sequence?",
    "start": 1034.88,
    "duration": 6.08
  },
  {
    "text": "Can I produce a minimal pattern? Can I produce something from which I think it's plausible that",
    "start": 1040.96,
    "duration": 5.76
  },
  {
    "text": "it emerged by itself? And that is to me this big important question of physics. The idea of",
    "start": 1046.72,
    "duration": 7.36
  },
  {
    "text": "physicalism to me is the notion that we live in a reality that is fully emergent over a coarsely",
    "start": 1054.08,
    "duration": 6.8
  },
  {
    "text": "closed mechanical layer. And we are in that base reality that emerges from it. And the alternatives",
    "start": 1060.88,
    "duration": 5.68
  },
  {
    "text": "to physicalism is that this base layer is somewhere else. Because even if we live in a simulation that",
    "start": 1066.56,
    "duration": 6.56
  },
  {
    "text": "is created by some kind of supernatural being, something must have created the supernatural being",
    "start": 1073.12,
    "duration": 5.36
  },
  {
    "text": "in its parent universe, right? So, ultimately, every supernatural event is going to have some kind of",
    "start": 1078.48,
    "duration": 5.44
  },
  {
    "text": "natural cause, some kind of prime mover that is taking away in the void and producing the",
    "start": 1083.92,
    "duration": 5.6
  },
  {
    "text": "patterns that we observe. And the patterns that we observe are so damn regular. And there's all",
    "start": 1089.52,
    "duration": 4.8
  },
  {
    "text": "this conservation going on of information that it doesn't seem like a conspiracy to me. It seems",
    "start": 1094.32,
    "duration": 7.44
  },
  {
    "text": "that we're not in a simulation. It seems that the idea that consciousness could be primary to our",
    "start": 1101.76,
    "duration": 5.04
  },
  {
    "text": "reality is not true. Because consciousness being primary means that you would have to live in",
    "start": 1106.8,
    "duration": 4.8
  },
  {
    "text": "somebody else's mind. That we live in some kind of conspirational simulation that somebody has set",
    "start": 1111.6,
    "duration": 6.0
  },
  {
    "text": "up for us. And while that is possible, and I can in principle not exclude it, because there can be no",
    "start": 1117.6,
    "duration": 4.48
  },
  {
    "text": "evidence that can ever be fully conclusive if somebody sets it up to deceive me, there is no",
    "start": 1122.08,
    "duration": 5.76
  },
  {
    "text": "reason for me to believe it. Because there are not enough things happening in my reality that",
    "start": 1127.84,
    "duration": 4.24
  },
  {
    "text": "counteract the notion that I live in a mechanical universe. The few things that pop up, I can still",
    "start": 1132.08,
    "duration": 5.68
  },
  {
    "text": "explain this by faulty memories and psychosis. Right? So, the only thing that needs to be explained,",
    "start": 1137.76,
    "duration": 7.12
  },
  {
    "text": "I was puzzling people like Turing and other thinkers, is there's a possibility that telepathy",
    "start": 1145.2,
    "duration": 5.04
  },
  {
    "text": "is true. If that would be true, right, it would not be compatible with the way in which we",
    "start": 1150.24,
    "duration": 5.2
  },
  {
    "text": "understand physics right now. And there's this question, is there a point at which we have to",
    "start": 1155.44,
    "duration": 4.4
  },
  {
    "text": "discard physics fully and accept that you live in some kind of simulation, in some kind of dream",
    "start": 1159.84,
    "duration": 4.56
  },
  {
    "text": "universe that somebody has set up, like a computer game where you can arbitrarily break causality",
    "start": 1164.4,
    "duration": 4.64
  },
  {
    "text": "when it's convenient? Or is this something that we need to extend physics? Or is it just",
    "start": 1169.04,
    "duration": 6.32
  },
  {
    "text": "something where our minds are playing tricks with us? And we know our minds are playing lots of",
    "start": 1175.36,
    "duration": 4.16
  },
  {
    "text": "tricks with us. So, Turing considered the possibility that telepathy exists as very real",
    "start": 1179.52,
    "duration": 6.16
  },
  {
    "text": "to this, to the point where he included this in his 1950 paper, Computing Machinery and",
    "start": 1185.68,
    "duration": 5.12
  },
  {
    "text": "Intelligence, where he sketches out the Turing test and seriously asks what the Turing test would",
    "start": 1190.8,
    "duration": 5.2
  },
  {
    "text": "have to involve for such a system, the ability to be telepathic. And if it's not, what difference",
    "start": 1196.0,
    "duration": 6.64
  },
  {
    "text": "would it make? Doesn't get to the point where he assesses out loud that if telepathy is possible,",
    "start": 1202.64,
    "duration": 5.76
  },
  {
    "text": "you cannot be sure which of your thoughts and feelings originate in your own brain. They could",
    "start": 1208.4,
    "duration": 4.48
  },
  {
    "text": "come from somewhere else, right? So, this opens up the door to lots and lots of things. But for",
    "start": 1212.88,
    "duration": 6.48
  },
  {
    "text": "the time being, I think that the evidence for telepathy is weak. And if telepathy would exist,",
    "start": 1219.36,
    "duration": 6.48
  },
  {
    "text": "I would be seriously willing to consider this together with Turing. It's not clear whether we",
    "start": 1226.4,
    "duration": 5.36
  },
  {
    "text": "cannot find a mechanical explanation for it. There's always going to be some kind of computer",
    "start": 1231.76,
    "duration": 5.28
  },
  {
    "text": "program that explains the patterns on the screen. Now, if we think about space, to me as a kid that",
    "start": 1237.04,
    "duration": 9.2
  },
  {
    "text": "was programming, the notion of a continuous space never made sense. Because it's not computable. I",
    "start": 1246.32,
    "duration": 5.6
  },
  {
    "text": "cannot write something that is continuous space. And when I tried to wrap my mind around the",
    "start": 1251.92,
    "duration": 4.64
  },
  {
    "text": "mathematics, the language broke. I was not able to understand how to make a point that is infinitely",
    "start": 1256.56,
    "duration": 6.32
  },
  {
    "text": "small, yet fits together. If you add infinitely many of these points into a continuum,",
    "start": 1262.88,
    "duration": 5.28
  },
  {
    "text": "this just doesn't work, right? But it's not a problem to make something that exactly looks",
    "start": 1269.84,
    "duration": 5.36
  },
  {
    "text": "like this. It's not a problem to make a computer game that looks continuous. It's not a computer",
    "start": 1275.2,
    "duration": 4.88
  },
  {
    "text": "game that produces physics that looks similar to what we can observe, at least in the simplification.",
    "start": 1280.08,
    "duration": 5.44
  },
  {
    "text": "Of course, our computers are extremely inefficient when it comes to simulating the substrate layer,",
    "start": 1285.52,
    "duration": 7.36
  },
  {
    "text": "the quantum mechanics that we can observe, or a layer below the quantum mechanics, because quantum",
    "start": 1292.88,
    "duration": 5.92
  },
  {
    "text": "mechanics is probably not the lowest layer in which physics plays out. It's just the lowest",
    "start": 1298.8,
    "duration": 5.12
  },
  {
    "text": "layer in which we can currently make observations that we can conceptualize. And this leads us to",
    "start": 1303.92,
    "duration": 5.36
  },
  {
    "text": "what you also mentioned, what is a photon? I don't think that Einstein started out with the assumption",
    "start": 1309.28,
    "duration": 5.68
  },
  {
    "text": "that the speed of light is fixed. I think it was a derivation that he made. He concluded that the",
    "start": 1314.96,
    "duration": 5.28
  },
  {
    "text": "speed of light is fixed. And he basically, once he had this conclusion, he had implications for",
    "start": 1320.24,
    "duration": 7.12
  },
  {
    "text": "the possible descriptions of space-time that emerged. Because when the speed of light is fixed,",
    "start": 1327.36,
    "duration": 5.84
  },
  {
    "text": "you end up with some very interesting paradoxes if you stay in a Newtonian universe. You have",
    "start": 1333.2,
    "duration": 6.0
  },
  {
    "text": "this issue, imagine you fly in a very fast spaceship, and you are shooting light out of",
    "start": 1339.2,
    "duration": 6.24
  },
  {
    "text": "your flashlight inside of your spaceship. Wouldn't the speed of light necessarily add up to the speed",
    "start": 1345.44,
    "duration": 6.0
  },
  {
    "text": "of the spaceship to an external observer? So wouldn't this external observer not need to",
    "start": 1351.44,
    "duration": 5.44
  },
  {
    "text": "observe a different speed of light than the person traveling in the spaceship? And if the speed of",
    "start": 1356.88,
    "duration": 4.48
  },
  {
    "text": "light is constant always, it means that the thing that now has to change is time or space or both.",
    "start": 1361.36,
    "duration": 6.88
  },
  {
    "text": "You can still fix this if you make sure that the speed of time runs in a different way.",
    "start": 1368.96,
    "duration": 6.0
  },
  {
    "text": "And this leads us to the insight that the time and space that we observe from our own perspectives",
    "start": 1374.96,
    "duration": 6.08
  },
  {
    "text": "as emergent observer and whatever universe produces us are interdependent. They're not",
    "start": 1381.04,
    "duration": 5.04
  },
  {
    "text": "independent of each other. The speed of light depends on the trajectory that, you know, the speed",
    "start": 1386.08,
    "duration": 5.2
  },
  {
    "text": "of time depends on the trajectory that you are taking through the universe. And if you want to",
    "start": 1391.28,
    "duration": 6.4
  },
  {
    "text": "think about something that could be more fundamental, we would say that the photon is a carrier of",
    "start": 1397.68,
    "duration": 6.4
  },
  {
    "text": "the electromagnetic force. It's a type of boson, which means it can be described as a certain",
    "start": 1404.08,
    "duration": 4.96
  },
  {
    "text": "pattern that has an integer spin. And it has the property that it is describing the potentiality",
    "start": 1409.04,
    "duration": 7.6
  },
  {
    "text": "for measuring some electromagnetic interaction. So if we take space-time from the perspective of",
    "start": 1416.64,
    "duration": 5.36
  },
  {
    "text": "the observer, it's the set of locations that can contain information and the set of trajectories",
    "start": 1422.0,
    "duration": 6.16
  },
  {
    "text": "that the information can take. And the photon is a model of information traveling through space-time.",
    "start": 1428.16,
    "duration": 5.92
  },
  {
    "text": "And what we have discovered and what Einstein also sometimes suspected is that space itself",
    "start": 1434.88,
    "duration": 7.36
  },
  {
    "text": "cannot be fundamental. And there were concrete reasons to see this because what was discovered",
    "start": 1442.24,
    "duration": 6.64
  },
  {
    "text": "during Einstein's career, even when he was aware of this discovery, was that there were singularities",
    "start": 1449.6,
    "duration": 5.6
  },
  {
    "text": "in space-time, which means points at where the mathematics of continuous space breaks down.",
    "start": 1455.2,
    "duration": 5.28
  },
  {
    "text": "So your mathematics doesn't work anymore. You have some kind of a division by zero. Something",
    "start": 1461.44,
    "duration": 4.56
  },
  {
    "text": "unpleasant happens where your mathematics is no longer valid. And what Einstein saw is that",
    "start": 1466.0,
    "duration": 6.08
  },
  {
    "text": "you can fix this by shifting the singularities around in our space-time model. And we can",
    "start": 1472.08,
    "duration": 6.64
  },
  {
    "text": "basically put them below the carpet. We can put them in centers of mass. So in the center of mass,",
    "start": 1478.72,
    "duration": 6.4
  },
  {
    "text": "there is basically something like a little black hole where mathematics doesn't work anymore. The",
    "start": 1485.12,
    "duration": 4.24
  },
  {
    "text": "mathematics of space-time, where your mathematical description of that world doesn't work anymore.",
    "start": 1489.36,
    "duration": 3.68
  },
  {
    "text": "And what could be more fundamental than space-time? I think it could be transitions. So",
    "start": 1494.0,
    "duration": 5.04
  },
  {
    "text": "you describe the universe as some kind of state vector, a set of information, and this",
    "start": 1499.04,
    "duration": 4.64
  },
  {
    "text": "information is dynamic. You have the way in which information moves between the locations.",
    "start": 1503.68,
    "duration": 4.8
  },
  {
    "text": "And in this paradigm, the speed of light could be the rate at which information propagates between",
    "start": 1509.12,
    "duration": 6.88
  },
  {
    "text": "locations. And this would be an upper limit of all interactions that we observe within this",
    "start": 1516.0,
    "duration": 6.64
  },
  {
    "text": "lattice, where stuff is densely connected. What would be necessary to, if you have a set",
    "start": 1523.44,
    "duration": 7.12
  },
  {
    "text": "of locations, some kind of graph, a causal graph, and information flowing between them,",
    "start": 1530.56,
    "duration": 4.0
  },
  {
    "text": "to understand that there is causal structure? Well, you need to understand where the information comes from",
    "start": 1534.56,
    "duration": 4.88
  },
  {
    "text": "to understand what it signifies, so you can model it. How can a single bit mean anything to you if",
    "start": 1539.44,
    "duration": 5.36
  },
  {
    "text": "it's just a single bit, if it's not attached with the source, with the type, with the context?",
    "start": 1544.8,
    "duration": 4.56
  },
  {
    "text": "So what could be a way to figure out where information comes from? Well, it needs to have",
    "start": 1550.08,
    "duration": 4.48
  },
  {
    "text": "some kind of momentum, some kind of direction. To carry information about direction, and you",
    "start": 1554.56,
    "duration": 5.76
  },
  {
    "text": "send this to a graph that by itself just has just locations, connections. The only way that you can",
    "start": 1560.32,
    "duration": 5.2
  },
  {
    "text": "do this is if this thing is extended, if it's not just a single location to which the information",
    "start": 1565.52,
    "duration": 5.92
  },
  {
    "text": "propagates, but if it's neighboring connections, and you get information that verifies it. So you",
    "start": 1571.44,
    "duration": 4.48
  },
  {
    "text": "need to be in some kind of densely strung lattice for information that you can pinpoint.",
    "start": 1575.92,
    "duration": 5.52
  },
  {
    "text": "Basically, you need to have something that looks like a continuous space, so you can identify",
    "start": 1582.24,
    "duration": 4.72
  },
  {
    "text": "controllable structure that you can identify where stuff comes from, like a photon. And if there is",
    "start": 1586.96,
    "duration": 7.04
  },
  {
    "text": "information that is traveling across distance, so to speak, that is non-local, that is not",
    "start": 1594.0,
    "duration": 5.04
  },
  {
    "text": "going through densely connected local connections, but that is going over individual long-range links,",
    "start": 1599.04,
    "duration": 5.36
  },
  {
    "text": "this information will look like a random fluctuation or a distant entanglement that you can",
    "start": 1604.4,
    "duration": 4.64
  },
  {
    "text": "no longer track if you don't know where it originated. And this will look like something like",
    "start": 1609.04,
    "duration": 5.84
  },
  {
    "text": "indeterminism from your local observer perspective. Still, it would not be in contradiction to the",
    "start": 1615.92,
    "duration": 6.8
  },
  {
    "text": "preservation of information. It would still be a universe in which information is not invented,",
    "start": 1623.52,
    "duration": 4.64
  },
  {
    "text": "but in which the amount of discernible information is constant. And if the universe was not in such",
    "start": 1628.16,
    "duration": 6.72
  },
  {
    "text": "a way that information would be preserved, of course it would not be learnable, because it would mean",
    "start": 1634.88,
    "duration": 4.96
  },
  {
    "text": "that the present state of the universe is forgetting what happened before in the universe.",
    "start": 1639.84,
    "duration": 5.6
  },
  {
    "text": "It gets disconnected, the worldline of the universe just gets disconnected. And so from an epistemological",
    "start": 1645.44,
    "duration": 5.44
  },
  {
    "text": "perspective, we can only learn the aspects of the universe that look like they are conserved.",
    "start": 1650.88,
    "duration": 5.12
  },
  {
    "text": "If there are things in the universe that are not conserved, then they will not be intelligible to us.",
    "start": 1656.0,
    "duration": 4.16
  },
  {
    "text": "And of course it's conceivable that the universe is some kind of automaton that forgets information.",
    "start": 1660.8,
    "duration": 5.04
  },
  {
    "text": "Another thing that shows us that space-time cannot be fundamental, besides a well-theorized",
    "start": 1666.96,
    "duration": 7.04
  },
  {
    "text": "which destroys the notion of locality, is the notion of the collapse of the wave function.",
    "start": 1674.0,
    "duration": 5.6
  },
  {
    "text": "Basically, this collapse of the wave function is the point in the history of an observer beyond",
    "start": 1679.6,
    "duration": 5.92
  },
  {
    "text": "which we cannot obtain a model of locations of events in time and space.",
    "start": 1685.6,
    "duration": 5.84
  },
  {
    "text": "Beyond that point, it's no longer not just that we don't have enough information to construct it,",
    "start": 1692.48,
    "duration": 5.84
  },
  {
    "text": "but it makes no sense anymore to assume that the photon was at a particular point when it",
    "start": 1698.32,
    "duration": 4.72
  },
  {
    "text": "went to the double slit. At this point, the space-time model breaks down. The space-time",
    "start": 1703.04,
    "duration": 5.28
  },
  {
    "text": "model is a mathematical abstraction that works relatively well to look at things happening in",
    "start": 1708.32,
    "duration": 5.52
  },
  {
    "text": "the limit. But it's not a model that can be fundamental, I think. But I'm not a physicist,",
    "start": 1713.84,
    "duration": 6.96
  },
  {
    "text": "so I'm not actually qualified to have these opinions. This is just what it looks like to",
    "start": 1720.8,
    "duration": 3.52
  },
  {
    "text": "me as a computer scientist who tries to understand the mind and thinks like Donald, that we have to",
    "start": 1724.32,
    "duration": 5.84
  },
  {
    "text": "understand a certain degree of physics to make sure that our theories of consciousness are tight",
    "start": 1731.04,
    "duration": 6.48
  },
  {
    "text": "and that they make sense. And we have to understand in which way they could possibly",
    "start": 1737.52,
    "duration": 4.88
  },
  {
    "text": "relate to physics. I'm less convinced that Donald, that a deep understanding of physics is necessary",
    "start": 1742.4,
    "duration": 6.16
  },
  {
    "text": "or that physics is going to teach us about consciousness, in part because I don't think that",
    "start": 1748.56,
    "duration": 5.04
  },
  {
    "text": "consciousness is that mysterious anymore. I spent a lot of time in my life thinking that it was",
    "start": 1753.6,
    "duration": 6.56
  },
  {
    "text": "mysterious, but it seems to be a riddle that can be solved. And basically, I think that there's some",
    "start": 1760.16,
    "duration": 6.96
  },
  {
    "text": "aspects to consciousness, for instance, that you're observing yourself to be observing,",
    "start": 1767.12,
    "duration": 4.96
  },
  {
    "text": "but consciousness is something that is entirely virtual. It's not a physical thing.",
    "start": 1772.08,
    "duration": 5.36
  },
  {
    "text": "Electrons, photons, physical entities, neurons, brains cannot be conscious. They're just",
    "start": 1778.88,
    "duration": 5.12
  },
  {
    "text": "mechanisms. And what we can see is that the elements of our consciousness are not mechanical,",
    "start": 1784.0,
    "duration": 6.24
  },
  {
    "text": "they're magical somehow. There is magic happening. And if there is magic happening, it means that",
    "start": 1790.24,
    "duration": 5.2
  },
  {
    "text": "it's an a-causal structure. It's something that has been made on some kind of causal loom,",
    "start": 1795.44,
    "duration": 5.36
  },
  {
    "text": "but that is not necessarily built in the same mechanical way as physics is built.",
    "start": 1800.8,
    "duration": 5.76
  },
  {
    "text": "It's a story. It's a tale being told by a physical system to itself. And if you think about",
    "start": 1807.6,
    "duration": 6.48
  },
  {
    "text": "organisms, you often think of them as physical systems, and then neither, right? The organism",
    "start": 1814.08,
    "duration": 4.8
  },
  {
    "text": "doesn't exist. It's not the same, if you think about it. What exists are cells that interact",
    "start": 1818.88,
    "duration": 5.04
  },
  {
    "text": "with each other, and even the cells don't really exist. What exists are molecules, and even the",
    "start": 1823.92,
    "duration": 4.08
  },
  {
    "text": "molecules don't really exist, right? They're all layers of descriptions. They're models that we can",
    "start": 1828.0,
    "duration": 4.56
  },
  {
    "text": "make because they are coherent. They hold to some degree. It might be frazzling out at the boundaries,",
    "start": 1832.56,
    "duration": 7.68
  },
  {
    "text": "but there are ways of thinking about the flow of information in the universe.",
    "start": 1840.24,
    "duration": 3.76
  },
  {
    "text": "And the organism is a coherent pattern that we observe in the interaction between cells.",
    "start": 1844.72,
    "duration": 4.56
  },
  {
    "text": "And the cells have been set up by evolution to interact in this coherent pattern because",
    "start": 1849.92,
    "duration": 4.4
  },
  {
    "text": "when they interact, as if they were driven by a single spirit, by a single target, by a single",
    "start": 1854.32,
    "duration": 4.8
  },
  {
    "text": "telos, and if their behavior is coherent and consistent, that are state-building, then they",
    "start": 1859.12,
    "duration": 5.36
  },
  {
    "text": "have an advantage over cells which don't do that and just fight for themselves because together",
    "start": 1864.48,
    "duration": 4.24
  },
  {
    "text": "they can play longer games. By playing longer games, they can occupy niches in nature that cannot",
    "start": 1868.72,
    "duration": 6.16
  },
  {
    "text": "be occupied by control systems that play shorter games. And this is the benefit that organisms have,",
    "start": 1874.88,
    "duration": 6.24
  },
  {
    "text": "these coordinations between cells. And an organism is a function that describes this pattern in the",
    "start": 1881.12,
    "duration": 5.2
  },
  {
    "text": "cells. And the organism is facilitated by information processing across cells, among other things.",
    "start": 1886.32,
    "duration": 7.12
  },
  {
    "text": "To coordinate its interactions, the organism needs to have something like a telegraph network",
    "start": 1894.24,
    "duration": 5.52
  },
  {
    "text": "by which it's able to make models of reality and coordinate them between the cells and coordinate",
    "start": 1899.76,
    "duration": 4.72
  },
  {
    "text": "the behavior of the cells. And in animals, this telegraph system is facilitated in large part by",
    "start": 1904.48,
    "duration": 7.04
  },
  {
    "text": "the nervous system. It would not be necessary that the nervous system, basically every cell type, can",
    "start": 1911.52,
    "duration": 4.72
  },
  {
    "text": "do this. But if you want to make it fast, you need to have specialized cells that have a very quick,",
    "start": 1916.24,
    "duration": 4.96
  },
  {
    "text": "expensive metabolism and can send information over very long distances very quickly, which other cell",
    "start": 1921.2,
    "duration": 5.44
  },
  {
    "text": "types cannot. So, neurons are a specific type of cells that allow particular kinds of information",
    "start": 1926.64,
    "duration": 5.44
  },
  {
    "text": "processing. And this information processing has the property that it can put stuff on the screen.",
    "start": 1932.08,
    "duration": 5.52
  },
  {
    "text": "So, it's some kind of computer. It's a thing that can produce arbitrary sequences of patterns if it",
    "start": 1937.6,
    "duration": 5.36
  },
  {
    "text": "discovers a suitable function to produce them and implement them in the distributed networks of cells.",
    "start": 1942.96,
    "duration": 5.76
  },
  {
    "text": "And part of what they're doing is that they create a story about a being that lives in the outside",
    "start": 1949.76,
    "duration": 5.6
  },
  {
    "text": "world. And in our culture, we have difficulty understanding how that is, because we, in our",
    "start": 1955.36,
    "duration": 5.92
  },
  {
    "text": "culture, as a default, teach our kids that what they see is the physical world. And the physical",
    "start": 1961.28,
    "duration": 5.92
  },
  {
    "text": "world has sounds and colors and so on. Only much later, we tell them, well, it's slightly more",
    "start": 1967.2,
    "duration": 3.84
  },
  {
    "text": "complicated and sounds and color are not actually in physics. Everything that you consider to be",
    "start": 1971.04,
    "duration": 6.0
  },
  {
    "text": "sounds and colors is photons. Photons make electromagnetic interaction, which let air",
    "start": 1977.04,
    "duration": 4.72
  },
  {
    "text": "molecules push against each other so they can form regular waves. And colors are local dimensions that",
    "start": 1981.76,
    "duration": 7.2
  },
  {
    "text": "you get by measuring or sampling the frequency of the electromagnetic spectrum using different",
    "start": 1988.96,
    "duration": 6.32
  },
  {
    "text": "receptor types and making a model of them using polar coordinates. So, this is something that",
    "start": 1995.28,
    "duration": 6.32
  },
  {
    "text": "we don't tell the story fully to our children, which makes it even more confusing. And then we",
    "start": 2001.6,
    "duration": 4.16
  },
  {
    "text": "tell them photons are actually not little billiard balls, but they are regions in the space-time that",
    "start": 2005.76,
    "duration": 6.0
  },
  {
    "text": "have a potential for electromagnetic interaction. And this space that you're talking about is the",
    "start": 2011.76,
    "duration": 4.88
  },
  {
    "text": "photonic space. It's the space where you can possibly have photon interactions. For some reason,",
    "start": 2016.64,
    "duration": 5.52
  },
  {
    "text": "it's three-dimensional. And maybe there are other spaces that are not three-dimensional, and maybe",
    "start": 2022.16,
    "duration": 4.64
  },
  {
    "text": "in these spaces, you cannot have interacting matter in the same way. Because maybe in order to get",
    "start": 2026.8,
    "duration": 7.2
  },
  {
    "text": "stable objects, you need to make little knots in the electromagnetic structure or in the spatial",
    "start": 2034.0,
    "duration": 4.24
  },
  {
    "text": "structure, and you cannot make knots in 2D and in 4D, they fall apart. So, maybe that's the reason.",
    "start": 2038.24,
    "duration": 6.16
  },
  {
    "text": "Or maybe there's another one, and we haven't completely figured it out yet. And there are",
    "start": 2044.4,
    "duration": 3.28
  },
  {
    "text": "some candidates that explain why the space that we are in is three-dimensional. So, why is it that",
    "start": 2047.68,
    "duration": 5.28
  },
  {
    "text": "we are interacting with the photonic space and not with the others? Why are the others not seeming to",
    "start": 2052.96,
    "duration": 4.72
  },
  {
    "text": "form a connected space in this connected lattice? But we don't know the answer yet. At least, I'm",
    "start": 2057.68,
    "duration": 6.32
  },
  {
    "text": "not aware of the book that is sketching out the answer. And if I stumble on it, I pray that I",
    "start": 2064.0,
    "duration": 7.36
  },
  {
    "text": "understand it. But I think that there are other cultures that have a better intuitive understanding",
    "start": 2071.36,
    "duration": 5.52
  },
  {
    "text": "of what consciousness is. And if you look around, you find that some cultures don't find consciousness",
    "start": 2076.88,
    "duration": 4.96
  },
  {
    "text": "mysterious. I even suspect that in the core of our own culture, before the Tower of Babel that",
    "start": 2081.84,
    "duration": 5.92
  },
  {
    "text": "destroyed the shared understanding, it's still in there. So, a little bit obsessed these days with",
    "start": 2087.76,
    "duration": 6.56
  },
  {
    "text": "thinking about Genesis in the Bible and read this epistemologically correct, not as a myth that is",
    "start": 2094.32,
    "duration": 6.72
  },
  {
    "text": "stand-in for an origin theory until real science comes along, but as something that is literally",
    "start": 2101.52,
    "duration": 5.44
  },
  {
    "text": "true. So, what would that mean? I'm talking about the first book. I'm talking about the book that",
    "start": 2106.96,
    "duration": 7.12
  },
  {
    "text": "starts out with the creation of sky and darkness and heaven and earth and so on. And the thing with",
    "start": 2114.08,
    "duration": 7.2
  },
  {
    "text": "this story, if you take it literally the way in which Christianity interprets it, it's a story",
    "start": 2121.28,
    "duration": 4.8
  },
  {
    "text": "about a supernatural being creating a physical universe. And what's wrong with the story is that",
    "start": 2126.08,
    "duration": 4.48
  },
  {
    "text": "whoever tells it to you had no evidence that it was true. So, there is no claim. If somebody makes",
    "start": 2130.56,
    "duration": 5.76
  },
  {
    "text": "a claim without evidence, you don't have to listen. It could be interesting as a story for cultural",
    "start": 2136.32,
    "duration": 6.8
  },
  {
    "text": "reference, or it could be interesting as an idea for something that you could test. But if it's",
    "start": 2143.12,
    "duration": 3.76
  },
  {
    "text": "in principle not testable, this person cannot have that evidence. There is no secret source of",
    "start": 2146.88,
    "duration": 5.6
  },
  {
    "text": "knowledge that this person had. There is in principle nothing that some other person can",
    "start": 2152.48,
    "duration": 6.08
  },
  {
    "text": "have this with some kind of back channel by talking to a burning bush that would constitute",
    "start": 2159.12,
    "duration": 4.4
  },
  {
    "text": "a valid experiment. So, this reading makes no sense. It would never make any sense, but it could",
    "start": 2163.52,
    "duration": 7.6
  },
  {
    "text": "make sense, especially if you understand that sky and ground and light and sound and plants and",
    "start": 2171.12,
    "duration": 6.8
  },
  {
    "text": "animals and their names don't actually exist in physics. They only exist in our mind as a",
    "start": 2177.92,
    "duration": 5.68
  },
  {
    "text": "division of the universe into separate objects, so they become intelligible to us. And the way in",
    "start": 2183.6,
    "duration": 5.84
  },
  {
    "text": "which we construct these objects is inside of the mind. So, the creation of the universe that is",
    "start": 2189.44,
    "duration": 5.36
  },
  {
    "text": "being described in Genesis is not the physicalist universe with quantum mechanics. It's the creation",
    "start": 2194.8,
    "duration": 6.64
  },
  {
    "text": "of the experiential universe in which we are actually in, in which we find ourselves to be in.",
    "start": 2201.44,
    "duration": 4.24
  },
  {
    "text": "And the first thing that the mind is discovering when it creates this universe is how to make light,",
    "start": 2206.4,
    "duration": 5.2
  },
  {
    "text": "right? How to create neural oscillators that are creating a contrast between light and darkness.",
    "start": 2212.56,
    "duration": 6.88
  },
  {
    "text": "So, separate the light from the darkness and then organize this into multiple dimensions until you",
    "start": 2219.44,
    "duration": 4.96
  },
  {
    "text": "get a space. And then you align the space with the information from your vestibular organs and what",
    "start": 2224.4,
    "duration": 5.6
  },
  {
    "text": "you get is the two-dimensional plane of the ground and the three-dimensional space of the sky above it.",
    "start": 2230.0,
    "duration": 6.32
  },
  {
    "text": "Right? So, after you create light and darkness, you create, literally, every mind does this in",
    "start": 2236.8,
    "duration": 5.04
  },
  {
    "text": "their cognitive development, the sky and the ground. And then you discover the objects in it. So, you",
    "start": 2241.84,
    "duration": 6.08
  },
  {
    "text": "basically learn how to model materials in your mind. So, you have solids and you have liquids",
    "start": 2247.92,
    "duration": 5.84
  },
  {
    "text": "and you have organic shapes and you have animated agents. And then you discover features that you",
    "start": 2254.32,
    "duration": 5.6
  },
  {
    "text": "cannot interact with, like celestial bodies, and anchor them in the world and you learn how to",
    "start": 2259.92,
    "duration": 4.72
  },
  {
    "text": "navigate this world. And then you discover all the plants and the animals and you construct them in",
    "start": 2265.04,
    "duration": 4.24
  },
  {
    "text": "your mind and you associate them all with their names. So, again, of course, not a feature of the",
    "start": 2269.28,
    "duration": 4.8
  },
  {
    "text": "physical world. They are socially exchanged, these names and so on. We create this world together.",
    "start": 2274.08,
    "duration": 5.76
  },
  {
    "text": "And then, last but not least, we create a person. So, the thing that creates it is not a person yet.",
    "start": 2280.4,
    "duration": 9.44
  },
  {
    "text": "It's a mind that exists before a person is around. We don't remember how we made light.",
    "start": 2290.8,
    "duration": 4.48
  },
  {
    "text": "We don't remember how we discovered the sky and the ground in the first space. This was another",
    "start": 2296.08,
    "duration": 5.12
  },
  {
    "text": "observing agent in our own brain. And this observing agent in our own brain, at some point,",
    "start": 2301.2,
    "duration": 5.36
  },
  {
    "text": "discovers the needs of a person, of the needs of an organism, the organism that its brain",
    "start": 2306.56,
    "duration": 6.96
  },
  {
    "text": "is embedded in. And it creates a model of that, too. So, it creates an agent that is",
    "start": 2313.52,
    "duration": 7.52
  },
  {
    "text": "observing this universe, that is embedded in this universe, because this first observer in our own",
    "start": 2321.04,
    "duration": 4.96
  },
  {
    "text": "mind is discovering that such an entity exists. It's a useful model to describe reality, that",
    "start": 2326.0,
    "duration": 6.4
  },
  {
    "text": "there is a person that has needs and desires and social embedding and dreams and hopes and memories",
    "start": 2332.4,
    "duration": 5.28
  },
  {
    "text": "and expectations. And it will create a story of that. And that story is just as real as the trees",
    "start": 2337.68,
    "duration": 6.88
  },
  {
    "text": "that exist in our mind as imaginations or the trees or the forest and beyond the horizon. And",
    "start": 2344.56,
    "duration": 8.56
  },
  {
    "text": "as real as the sky and the clouds and the colors and so on. But they're all virtual. They're all",
    "start": 2353.12,
    "duration": 4.32
  },
  {
    "text": "simulacra. They all exist to tell a story to the organism that is useful for the organism to model",
    "start": 2357.44,
    "duration": 6.24
  },
  {
    "text": "the world. And this part where we become a person seems to be happening, I think, around the age of",
    "start": 2363.68,
    "duration": 7.2
  },
  {
    "text": "one and a half to two and a half, roughly, in most children that I observed. And at this point,",
    "start": 2370.88,
    "duration": 4.8
  },
  {
    "text": "a person that is different from before emerges in their mind. It's not that there is nobody there",
    "start": 2375.68,
    "duration": 4.56
  },
  {
    "text": "before. It's just that the thing before is different. And you notice that there is a gap",
    "start": 2380.24,
    "duration": 4.0
  },
  {
    "text": "in their memories. They have memories when they're in their first year when you talk to them,",
    "start": 2384.24,
    "duration": 5.36
  },
  {
    "text": "where they remember what happened and have expectations already. But later on, there is",
    "start": 2390.48,
    "duration": 5.6
  },
  {
    "text": "this point where they don't remember these things anymore. It's very weird. And most people, when",
    "start": 2396.08,
    "duration": 3.84
  },
  {
    "text": "they think back, don't have memories that they can consciously access before they're like two and a",
    "start": 2399.92,
    "duration": 5.36
  },
  {
    "text": "half years old. And so I wonder if this transition is the result of just a re-indexing of memories",
    "start": 2405.28,
    "duration": 5.12
  },
  {
    "text": "due to our newfound linguistic ability. So if we can later on no longer access these memories,",
    "start": 2410.4,
    "duration": 5.04
  },
  {
    "text": "or if it's really just basically a new agent that is created by the first agent in its own image",
    "start": 2415.44,
    "duration": 5.44
  },
  {
    "text": "as an observer that is aware of the fact that it's observing. But in a different way,",
    "start": 2421.52,
    "duration": 6.24
  },
  {
    "text": "as men and women, as something that thinks it's a person, that thinks it's a human being. And I'm",
    "start": 2427.76,
    "duration": 5.44
  },
  {
    "text": "not a human being. I realize that at some level. I don't have an identity as a human being. This is",
    "start": 2433.2,
    "duration": 4.64
  },
  {
    "text": "a story that my mind tells itself. It's an additional thing. My consciousness doesn't",
    "start": 2437.84,
    "duration": 4.8
  },
  {
    "text": "have an identity. My consciousness is also not of the nature that it's the same as everybody else's",
    "start": 2442.64,
    "duration": 6.24
  },
  {
    "text": "consciousness. The question, do we all have the same consciousness looking through different eyes",
    "start": 2448.88,
    "duration": 6.56
  },
  {
    "text": "or with separate consciousnesses, is in some sense as meaningless as the question of asking, is the",
    "start": 2455.44,
    "duration": 5.76
  },
  {
    "text": "text editor that you're running onto your computer the same text editor that everybody else runs on",
    "start": 2461.2,
    "duration": 4.64
  },
  {
    "text": "their computer? Or is it a different one? The program word is in some sense a natural law. If",
    "start": 2465.84,
    "duration": 8.08
  },
  {
    "text": "you put the circuits of your computer in the same functional configuration, then those things are",
    "start": 2473.92,
    "duration": 6.8
  },
  {
    "text": "going to happen with the circuits of your computer and they will afford the following interactions.",
    "start": 2480.72,
    "duration": 4.24
  },
  {
    "text": "But the program word doesn't have an identity. And it's also not that it has no identity in",
    "start": 2484.96,
    "duration": 4.32
  },
  {
    "text": "the sense it's just not a meaningful category to apply to it. In the same sense, my consciousness",
    "start": 2489.28,
    "duration": 4.8
  },
  {
    "text": "is not in this category that would have an identity or none. So it's not something that",
    "start": 2494.08,
    "duration": 5.76
  },
  {
    "text": "is shared with others. And it's not something that is separate from others. It's a principle",
    "start": 2499.84,
    "duration": 4.88
  },
  {
    "text": "that applies to the observation. And when the consciousness gets tied to a self-model,",
    "start": 2504.72,
    "duration": 4.32
  },
  {
    "text": "then it becomes perspectival and I have an identity and so on. But this identity is a",
    "start": 2509.04,
    "duration": 5.04
  },
  {
    "text": "particular kind of model that my organism tells itself by changing certain factors in my own brain.",
    "start": 2514.08,
    "duration": 7.52
  },
  {
    "text": "Okay. Let's let Don respond.",
    "start": 2522.16,
    "duration": 1.76
  },
  {
    "text": "Yeah. Well, there's quite a bit there. So on the nature of the physical world and computation",
    "start": 2524.8,
    "duration": 9.84
  },
  {
    "text": "and the finiteness versus continuity of space-time and so forth, I think that the work,",
    "start": 2537.84,
    "duration": 8.32
  },
  {
    "text": "you know, Gödel's incompleteness theorem is very relevant here. That the notion of truth",
    "start": 2547.12,
    "duration": 7.28
  },
  {
    "text": "is far deeper than the notion of proof. There are any system, any computational system will have",
    "start": 2556.4,
    "duration": 8.4
  },
  {
    "text": "things that it can prove, but there will be truths that that computational system cannot access.",
    "start": 2564.8,
    "duration": 6.4
  },
  {
    "text": "And if you add a new truth of, you know, like Gödel's statement to your set of axioms,",
    "start": 2572.08,
    "duration": 5.36
  },
  {
    "text": "then there'll be yet more truths that cannot be accessed from that. And so what you can compute",
    "start": 2577.44,
    "duration": 6.56
  },
  {
    "text": "is always going to be trivial to what is true. There will always be, as far as I can tell,",
    "start": 2585.44,
    "duration": 8.16
  },
  {
    "text": "again, it's sort of like Newton's notion of we're at the seashore and the vast ocean of",
    "start": 2593.6,
    "duration": 6.8
  },
  {
    "text": "of reality of the truths, he actually used the word truth, the vast ocean of truths is out there",
    "start": 2602.16,
    "duration": 6.08
  },
  {
    "text": "beyond what we can compute. And every truth that you add to your base for computation doesn't solve",
    "start": 2608.24,
    "duration": 6.72
  },
  {
    "text": "the problem. And you might say, well, that's true, you know, of abstract mathematics, but that's not",
    "start": 2614.96,
    "duration": 6.4
  },
  {
    "text": "true of physics. I mean, physics itself is computable, but that there's some recent work",
    "start": 2621.36,
    "duration": 6.72
  },
  {
    "text": "suggesting that that's not the case. So Tony Kubit, a physicist, and his colleagues",
    "start": 2628.56,
    "duration": 9.84
  },
  {
    "text": "have recently proved that a very important problem to condensed matter physicists",
    "start": 2639.04,
    "duration": 6.16
  },
  {
    "text": "called the spectral gap problem is not computable. And that's a stunning result.",
    "start": 2645.92,
    "duration": 10.72
  },
  {
    "text": "And they also suspect, and they're working on this, they haven't proven this yet, but that",
    "start": 2656.64,
    "duration": 3.84
  },
  {
    "text": "something that's a big open problem, I think the Millennium Prize Committee has, this is one of",
    "start": 2661.12,
    "duration": 5.2
  },
  {
    "text": "their problems, is to understand the Yang-Mills gas gap problem, which is, you know, why do",
    "start": 2666.32,
    "duration": 6.24
  },
  {
    "text": "photons and gravitons have no mass, but the recarious of the strong weak force do have mass?",
    "start": 2673.68,
    "duration": 6.16
  },
  {
    "text": "And Kubit and his collaborators think, again, that we're going to find that something",
    "start": 2680.64,
    "duration": 5.2
  },
  {
    "text": "non-computational is going on here. It's not decidable. And my guess is that this is just",
    "start": 2687.04,
    "duration": 5.68
  },
  {
    "text": "the beginning, that we're going to find that as powerful as computation is, and, you know,",
    "start": 2692.72,
    "duration": 5.44
  },
  {
    "text": "I was in the artificial intelligence lab at MIT for my PhD, and I'm all for AI and for computation,",
    "start": 2699.68,
    "duration": 5.6
  },
  {
    "text": "and I, you know, I think it's fabulous what computation can do. And the naysayers who",
    "start": 2705.28,
    "duration": 5.84
  },
  {
    "text": "think that the computation can't do amazing things and artificial intelligence can have",
    "start": 2711.12,
    "duration": 4.4
  },
  {
    "text": "important limits that, I think that the naysayers, I disagree with the naysayers.",
    "start": 2716.08,
    "duration": 4.72
  },
  {
    "text": "On the other hand, I do believe Gödel's incompleteness theorem is correct,",
    "start": 2722.16,
    "duration": 2.72
  },
  {
    "text": "and I do think that the notion of truth is just vastly, that the notion, the set of truths,",
    "start": 2725.68,
    "duration": 7.92
  },
  {
    "text": "I'll put it this way, the set of things that we can prove from any system is essentially probability",
    "start": 2734.64,
    "duration": 4.32
  },
  {
    "text": "zero in the set of all truths. In other words, we're always going to be, as I said,",
    "start": 2738.96,
    "duration": 5.04
  },
  {
    "text": "we're always going to be, as Newton said, on the seashore with computation, and it's for",
    "start": 2744.0,
    "duration": 6.08
  },
  {
    "text": "principled reasons. So it's not a mysterianism that's not founded, it's saying our best theories",
    "start": 2750.08,
    "duration": 7.28
  },
  {
    "text": "tell us that truth and proof are not the same thing, and that proofs will always only leave",
    "start": 2757.36,
    "duration": 5.76
  },
  {
    "text": "you on the seashore. And so that's why, I mean, I didn't like that conclusion, but, you know,",
    "start": 2763.12,
    "duration": 7.44
  },
  {
    "text": "Gödel proved it, and now physicists are finding it in, you know, the spectral gap, and so as much",
    "start": 2770.56,
    "duration": 6.48
  },
  {
    "text": "as I like computation, I'm a computer scientist myself, as much as I like computation, I have to",
    "start": 2777.04,
    "duration": 5.76
  },
  {
    "text": "defer to the mathematical proofs that say computation goes thus far and no further,",
    "start": 2782.8,
    "duration": 5.52
  },
  {
    "text": "then ask myself, okay, how can, so my conceptual system then is itself just a symbolic system.",
    "start": 2789.44,
    "duration": 9.28
  },
  {
    "text": "With derivation rules. So what I can compute by my thought is also going to be limited,",
    "start": 2800.64,
    "duration": 6.96
  },
  {
    "text": "which is why I was saying up front what I think about scientific theories, right? Scientific",
    "start": 2807.6,
    "duration": 4.8
  },
  {
    "text": "theories are going to have these limitations. We will put down a set of axioms, each theory,",
    "start": 2812.4,
    "duration": 6.16
  },
  {
    "text": "a good scientific theory will tell you exactly what it assumes, and it will also give you a hint",
    "start": 2818.56,
    "duration": 6.56
  },
  {
    "text": "about the kind of derivations that you can give from those assumptions, and then you use, you find",
    "start": 2825.12,
    "duration": 4.88
  },
  {
    "text": "what that theory will entail. But our best theories, like quantum theory and relativity,",
    "start": 2830.0,
    "duration": 8.4
  },
  {
    "text": "and evolution of natural selection, the best theories will also tell you where they stop.",
    "start": 2838.4,
    "duration": 5.04
  },
  {
    "text": "They will say we go this far and no further. And for example, physics tells us that",
    "start": 2843.44,
    "duration": 7.44
  },
  {
    "text": "space-time itself cannot be fundamental, that the very notion of space-time cannot be fundamental,",
    "start": 2852.32,
    "duration": 5.44
  },
  {
    "text": "which is stunning because physics for several centuries has essentially been the study of what",
    "start": 2857.76,
    "duration": 5.36
  },
  {
    "text": "happens in space and time. And so to say that space-time is not fundamental means that the",
    "start": 2863.12,
    "duration": 5.92
  },
  {
    "text": "physicists have to redefine what physics is about. And that's what, for example, Juan Maldacena and",
    "start": 2869.04,
    "duration": 6.16
  },
  {
    "text": "Nimar Kani-Hamed are trying to do with things like the cosmological polytope and amplituhedron",
    "start": 2875.2,
    "duration": 4.96
  },
  {
    "text": "and so forth. They're finding structures where there are no Hilbert spaces, so there's no quantum",
    "start": 2880.16,
    "duration": 5.84
  },
  {
    "text": "theory, there is no time, there is no space, there are these positive geometries, and what you find",
    "start": 2886.0,
    "duration": 7.52
  },
  {
    "text": "is you can predict events in space-time, like scattering processes that you see at the Large",
    "start": 2893.52,
    "duration": 6.24
  },
  {
    "text": "Hadron Collider, you can predict them, and in fact you can actually compute them in some sense",
    "start": 2899.76,
    "duration": 8.0
  },
  {
    "text": "better than if you assume space-time. So they're finding that, you know, if you use Feynman",
    "start": 2907.76,
    "duration": 4.72
  },
  {
    "text": "diagrams and try to compute scattering amplitudes for two gluons coming in and four gluons",
    "start": 2912.48,
    "duration": 5.04
  },
  {
    "text": "scattering out using the standard quantum field theoretic approaches where space and time is",
    "start": 2917.52,
    "duration": 5.28
  },
  {
    "text": "assumed, you get hundreds of pages of algebra and it's a mess. Whereas if you let go of space-time",
    "start": 2922.8,
    "duration": 6.0
  },
  {
    "text": "and look at these structures with symmetries that cannot be expressed in space-time, dual conformal",
    "start": 2928.8,
    "duration": 5.84
  },
  {
    "text": "symmetry, then you find that the same scattering amplitudes can be processed in just two or three",
    "start": 2934.64,
    "duration": 6.56
  },
  {
    "text": "terms that you can write down pen and paper on a sheet of paper. So all of a sudden, so what",
    "start": 2942.16,
    "duration": 5.12
  },
  {
    "text": "they're seeing is space-time has had a good run, but if you force yourself to stick with space-time,",
    "start": 2947.28,
    "duration": 7.68
  },
  {
    "text": "then the math is ugly, you get hundreds of pages of algebra to compute scattering amplitudes, you",
    "start": 2954.96,
    "duration": 5.12
  },
  {
    "text": "can't see the symmetries that are there, like dual conformal symmetry. If you let go of space-time,",
    "start": 2960.08,
    "duration": 5.84
  },
  {
    "text": "you're finding these amazing structures that they don't know what they're about,",
    "start": 2965.92,
    "duration": 3.04
  },
  {
    "text": "but all of a sudden you see the right symmetries and the computations become trivial.",
    "start": 2969.6,
    "duration": 3.92
  },
  {
    "text": "So there's some big hint that I think on a couple fronts from Gerdl and from the work by Tony Kubit",
    "start": 2974.24,
    "duration": 7.76
  },
  {
    "text": "and his team that the computation is as powerful as it is and as much as I love it as an AI person",
    "start": 2982.0,
    "duration": 7.68
  },
  {
    "text": "and a cognitive scientist, it's always going to be on the seashore with Newton. And when we let go",
    "start": 2990.32,
    "duration": 8.48
  },
  {
    "text": "of space-time, we're still of course as theorists always going to have a finite set of axioms and",
    "start": 2998.8,
    "duration": 6.8
  },
  {
    "text": "derivations about, you know, like the cosmological polytope and so forth that Nima and Juan are",
    "start": 3005.6,
    "duration": 5.84
  },
  {
    "text": "finding. We're still going to have a finite set of concepts and derivations, so we're not going",
    "start": 3011.44,
    "duration": 5.68
  },
  {
    "text": "to get around Gerdl's incompleteness theorem, but at least we're going beyond the notion of time,",
    "start": 3017.12,
    "duration": 5.12
  },
  {
    "text": "which is really critical. And that also cuts at the computational issues, pretty interesting.",
    "start": 3022.64,
    "duration": 7.28
  },
  {
    "text": "Computational complexity is about, you know, a lot of it is about time complexity.",
    "start": 3029.92,
    "duration": 4.56
  },
  {
    "text": "And what physicists are telling us is that ultimately we're going to have to let go of",
    "start": 3035.12,
    "duration": 5.12
  },
  {
    "text": "the notion of time. And so as computer scientists, we're going to have to rethink",
    "start": 3040.24,
    "duration": 3.76
  },
  {
    "text": "complexity issues when the very notion of time itself isn't fundamental. So that's going to be",
    "start": 3044.0,
    "duration": 6.0
  },
  {
    "text": "a real kicker for us in computer science. How do we think about complexity issues when time itself",
    "start": 3050.96,
    "duration": 7.44
  },
  {
    "text": "is not the right way to think about things? And therefore the sequence of computations in time",
    "start": 3058.4,
    "duration": 5.52
  },
  {
    "text": "is not the right way to think about things. We have some really deep thinking to do ahead.",
    "start": 3063.92,
    "duration": 4.96
  },
  {
    "text": "But where I think we share some common ground, Joscha, is I think that a lot of",
    "start": 3069.44,
    "duration": 7.28
  },
  {
    "text": "our experiences and so forth, our models that we built, I think that we are building internal",
    "start": 3077.68,
    "duration": 5.28
  },
  {
    "text": "models. But the question is, what is the apparatus that's building those models?",
    "start": 3082.96,
    "duration": 5.52
  },
  {
    "text": "And I'm saying it's nothing inside space and time. So in particular, I'll be very, very explicit. I",
    "start": 3090.32,
    "duration": 10.16
  },
  {
    "text": "don't think that neurons exist when they're not perceived. I don't think space-time exists when",
    "start": 3100.48,
    "duration": 6.24
  },
  {
    "text": "it's not perceived. I think neurons and space-time and even particles are simply data structures",
    "start": 3106.72,
    "duration": 9.92
  },
  {
    "text": "that we use. And there's a formulation of quantum theory that's very similar to this. It's called",
    "start": 3118.64,
    "duration": 8.64
  },
  {
    "text": "cubism, quantum Bayesianism, Chris Fuchs and David Merman, where they take this point of view that",
    "start": 3127.28,
    "duration": 6.72
  },
  {
    "text": "it's the every act of observation in physics, every experiment that you do is an act of fact creation.",
    "start": 3134.0,
    "duration": 8.72
  },
  {
    "text": "Right? It's not that there are pre-existing particles with pre-existing states and you're",
    "start": 3143.76,
    "duration": 4.64
  },
  {
    "text": "measuring those states. Rather, they're subjective Bayesians. So all the probabilities in quantum",
    "start": 3148.4,
    "duration": 9.52
  },
  {
    "text": "theory are subjective probabilities. They're not objective probabilities. And every outcome is a",
    "start": 3157.92,
    "duration": 5.28
  },
  {
    "text": "fact creation. And they do have, I mean, Chris Fuchs has a very interesting 2010 paper",
    "start": 3164.96,
    "duration": 5.52
  },
  {
    "text": "called Cubism that I highly recommend. And in that paper, he actually points to a very interesting",
    "start": 3170.48,
    "duration": 6.48
  },
  {
    "text": "quantum discovery that there's a sequence of what's proven is that even if you know what the",
    "start": 3178.4,
    "duration": 9.76
  },
  {
    "text": "outcome of your experiment is going to be with probability one, that does not entail that the",
    "start": 3188.16,
    "duration": 5.84
  },
  {
    "text": "outcome is there and exists independent of your observation. That's a stunning thing to say.",
    "start": 3194.0,
    "duration": 5.44
  },
  {
    "text": "It's a probability one, you know, with probability one, what you're going to measure. And yet you can",
    "start": 3199.44,
    "duration": 4.4
  },
  {
    "text": "prove with quantum mechanics that it's impossible that the outcome was there, the value existed",
    "start": 3203.84,
    "duration": 7.36
  },
  {
    "text": "before you made the measurement. So that the, it's really the case that the acts of observation",
    "start": 3211.2,
    "duration": 5.84
  },
  {
    "text": "are fact creations, not fact discoveries. So most of the work that's done in consciousness",
    "start": 3217.6,
    "duration": 11.84
  },
  {
    "text": "assumes, and I would say this is 99% of the theories that I've seen in consciousness,",
    "start": 3230.4,
    "duration": 4.88
  },
  {
    "text": "assume that space-time is fundamental, assume that physical particles are fundamental,",
    "start": 3235.84,
    "duration": 5.2
  },
  {
    "text": "and that somehow neural activity in humans and perhaps other kinds of more complex activity in",
    "start": 3241.04,
    "duration": 7.76
  },
  {
    "text": "AIs creates consciousness. But the very founding assumptions that space-time is fundamental,",
    "start": 3248.8,
    "duration": 7.2
  },
  {
    "text": "that neurons exist when they're not perceived, contradicts our best physics. And it also",
    "start": 3256.0,
    "duration": 5.44
  },
  {
    "text": "contradicts evolution of natural selection, which is very, very clear. Natural selection makes it",
    "start": 3261.44,
    "duration": 8.0
  },
  {
    "text": "very clear that the probability is zero, that the sensory systems of any organism tell them any",
    "start": 3269.44,
    "duration": 7.28
  },
  {
    "text": "truths about objective reality. What they tell organisms, sensory systems evolved to tell",
    "start": 3276.72,
    "duration": 6.72
  },
  {
    "text": "organisms how to behave in order to stay alive, period. That's it. And so that gives you a user",
    "start": 3283.44,
    "duration": 8.16
  },
  {
    "text": "interface for staying alive, but gives you no access to the truth. And that fits with what",
    "start": 3291.6,
    "duration": 6.0
  },
  {
    "text": "physics is telling us, that space-time is a user interface, but it's not the final truth.",
    "start": 3297.6,
    "duration": 5.04
  },
  {
    "text": "And so what I want from a theory of consciousness as a scientist is I want a clear statement of",
    "start": 3302.64,
    "duration": 8.72
  },
  {
    "text": "what am I assuming? What are the exact things that my theory takes as primitive?",
    "start": 3312.24,
    "duration": 4.56
  },
  {
    "text": "What are the exact rules that allow me to derive things from those primitives? And how exactly do",
    "start": 3318.08,
    "duration": 6.48
  },
  {
    "text": "I get the taste of chocolate from that? That's what I'm looking for from a theory of consciousness,",
    "start": 3324.56,
    "duration": 6.48
  },
  {
    "text": "precise statement of exactly what I'm assuming up front with mathematical precision, and then",
    "start": 3331.04,
    "duration": 5.6
  },
  {
    "text": "precise derivation. If I'm not taking the taste of chocolate as fundamental, if I'm saying that",
    "start": 3336.64,
    "duration": 4.64
  },
  {
    "text": "somehow some dynamical system is going to give it to me, then I want to know exactly which",
    "start": 3341.28,
    "duration": 5.12
  },
  {
    "text": "dynamical system is giving me the taste of chocolate and why that dynamical system could",
    "start": 3346.4,
    "duration": 5.44
  },
  {
    "text": "not be the smell of garlic. I want to know exactly. Otherwise, there's no real science on the table",
    "start": 3351.84,
    "duration": 5.6
  },
  {
    "text": "at all. So that's what I'm looking for, is theories that say exactly what the assumptions are",
    "start": 3358.56,
    "duration": 4.72
  },
  {
    "text": "and tell me exactly for at least one specific conscious experience, how that conscious experience",
    "start": 3363.28,
    "duration": 5.44
  },
  {
    "text": "must be derived in that way. And so that's where I'm coming from on those.",
    "start": 3369.28,
    "duration": 5.2
  },
  {
    "text": "Now, in the case of cells and the brain, I would just mention something that's very interesting,",
    "start": 3374.48,
    "duration": 6.4
  },
  {
    "text": "that you probably know about Mike Levin's work. And he's finding that cells, not just neurons,",
    "start": 3380.88,
    "duration": 9.12
  },
  {
    "text": "but any cell in animals that, in fact, outside of the brain, they can learn and they can compute",
    "start": 3390.24,
    "duration": 10.48
  },
  {
    "text": "and they can do morphogenesis of the cell's body. They use gap junction, communication, electric.",
    "start": 3401.52,
    "duration": 8.72
  },
  {
    "text": "So they're effectively doing what neurons do, but in a very, very different way. And this is,",
    "start": 3410.24,
    "duration": 6.64
  },
  {
    "text": "all cells can communicate in this way with gap junctions and so forth. So I suspect that",
    "start": 3416.88,
    "duration": 6.0
  },
  {
    "text": "we're going to find that neurons aren't special in the sense of being information processors,",
    "start": 3424.8,
    "duration": 7.2
  },
  {
    "text": "that information processing, and this seems to be where Mike is heading, is that information",
    "start": 3432.0,
    "duration": 6.4
  },
  {
    "text": "processing is happening in what he calls these bioelectric fields, even if there are no neurons,",
    "start": 3438.4,
    "duration": 6.0
  },
  {
    "text": "and that they can learn, they can retain memories, and they can be very intelligent.",
    "start": 3444.4,
    "duration": 4.24
  },
  {
    "text": "So even as neuroscientists, we may find that we'll have to expand our horizons beyond neuroscience",
    "start": 3449.36,
    "duration": 7.6
  },
  {
    "text": "and understand, if I were a reductionist and trying to do biological reduction, I would,",
    "start": 3456.96,
    "duration": 5.12
  },
  {
    "text": "at this point with Mike Levin's stuff, be interested to say, well, maybe I wouldn't",
    "start": 3462.08,
    "duration": 5.2
  },
  {
    "text": "necessarily reduce consciousness to neural activity. Maybe these gap junctions and the",
    "start": 3467.28,
    "duration": 4.32
  },
  {
    "text": "computations that cells can do would also be a suitable format. But again, I'm not a",
    "start": 3471.6,
    "duration": 6.8
  },
  {
    "text": "reductionist in that sense, but I'll stop unless you respond, Josche.",
    "start": 3478.4,
    "duration": 3.36
  },
  {
    "text": "Thank you. You went very far and wide and tried to be a little bit more concise.",
    "start": 3484.56,
    "duration": 6.32
  },
  {
    "text": "Let's start out with Gödel. Gödel's proof had a very profound and not necessarily very positive",
    "start": 3491.52,
    "duration": 7.52
  },
  {
    "text": "influence on philosophy. And basically, Lukács and others in philosophy opened up a tradition",
    "start": 3499.04,
    "duration": 7.36
  },
  {
    "text": "that the underlying current is that what Gödel has shown is that mathematics is impotent",
    "start": 3506.4,
    "duration": 6.16
  },
  {
    "text": "to describe reality. And therefore, reality can only be described by people who don't really know",
    "start": 3513.2,
    "duration": 6.56
  },
  {
    "text": "mathematics, that is philosophers. So philosophers like that intuition. But it implies that there is",
    "start": 3519.76,
    "duration": 6.4
  },
  {
    "text": "something beyond mathematics that allows you to make sense of things that assign truth. And",
    "start": 3526.16,
    "duration": 7.12
  },
  {
    "text": "slightly deeper, when you say that you like computation and you value it and so on, and you",
    "start": 3534.0,
    "duration": 4.88
  },
  {
    "text": "see its limits, it implies that you see what comes beyond these limits and you're using that thing",
    "start": 3538.88,
    "duration": 4.48
  },
  {
    "text": "beyond the limits to think. And I don't think that you are. Everything in my own mind that I can",
    "start": 3543.36,
    "duration": 6.32
  },
  {
    "text": "observe, when I observe myself perceiving, when I perceive myself reflecting, when I perceive myself",
    "start": 3549.68,
    "duration": 6.4
  },
  {
    "text": "reasoning, is computational. It means that I go from state to state in a somewhat deterministic",
    "start": 3556.08,
    "duration": 6.56
  },
  {
    "text": "way. The random parts are just deleting bits that I computed before, so I have to do it again. The",
    "start": 3562.64,
    "duration": 5.44
  },
  {
    "text": "randomness and determinism doesn't help me. So the part of my mind that is relevant to my thinking",
    "start": 3568.08,
    "duration": 6.16
  },
  {
    "text": "is fundamentally computational. What Gödel discovered, and is often misunderstood, and also",
    "start": 3574.24,
    "duration": 5.92
  },
  {
    "text": "by Gödel himself, is a very important thing. What Gödel has discovered is not that truth is deeper",
    "start": 3580.16,
    "duration": 6.48
  },
  {
    "text": "than proof. That was in some sense the suspicion which he started with. He knew that, in his view,",
    "start": 3586.64,
    "duration": 7.92
  },
  {
    "text": "that truth is platonic, that things can be true or not regardless of whether we find out or whether",
    "start": 3594.56,
    "duration": 6.32
  },
  {
    "text": "it can be found out. And he hoped to find a notion of truth, of proof, that could reach truth.",
    "start": 3600.88,
    "duration": 6.56
  },
  {
    "text": "And he found that it couldn't, and he found this in a devastating way.",
    "start": 3608.8,
    "duration": 3.36
  },
  {
    "text": "And he drew the conclusion that there is truth that cannot be found with mathematics.",
    "start": 3613.2,
    "duration": 4.72
  },
  {
    "text": "And the opposite is true. There is no deeper notion of truth than proof. You see,",
    "start": 3618.96,
    "duration": 7.2
  },
  {
    "text": "a perception cannot be true or false. Perception just is. Physical events out there in the universe",
    "start": 3626.24,
    "duration": 7.84
  },
  {
    "text": "cannot be true or false. They just are. A pattern that you observe is not true or false, it just is.",
    "start": 3634.08,
    "duration": 4.72
  },
  {
    "text": "Right? You could be erroneously thinking that you're perceiving a pattern when you don't,",
    "start": 3639.68,
    "duration": 3.44
  },
  {
    "text": "because you're suffering from false memory or a delusion or whatever that makes your thinking",
    "start": 3643.12,
    "duration": 4.56
  },
  {
    "text": "or perception inconsistent. But the pattern itself is not true or false. It's an interpretation that",
    "start": 3647.68,
    "duration": 5.84
  },
  {
    "text": "can be true or false. And the interpretation has to be in a symbolic language to have the property",
    "start": 3653.6,
    "duration": 6.24
  },
  {
    "text": "that can be true or false. A perceptual interpretation by itself is not true or false,",
    "start": 3659.84,
    "duration": 4.32
  },
  {
    "text": "it just is. Right? So in order to be true or false, you need to have a language. And the",
    "start": 3664.16,
    "duration": 6.08
  },
  {
    "text": "language needs to be defined in such a way that truth can be established. And the process of",
    "start": 3670.24,
    "duration": 5.2
  },
  {
    "text": "establishing truth is a computation. And there are two types of languages in which truth can be",
    "start": 3675.44,
    "duration": 5.76
  },
  {
    "text": "defined. And the language of classical mathematics is a stateless language. It's one where time",
    "start": 3681.2,
    "duration": 7.36
  },
  {
    "text": "doesn't exist, where everything happens all at once or in some kind of eternal moment. So if you",
    "start": 3688.56,
    "duration": 6.16
  },
  {
    "text": "want to go from state to state in this language of eternal mathematics, in the stateless language,",
    "start": 3694.72,
    "duration": 4.48
  },
  {
    "text": "you just assign an index and then you iterate over the index and you do this in a single instant,",
    "start": 3699.2,
    "duration": 4.88
  },
  {
    "text": "in one moment. And the stateless mathematics has a very beautiful property. It allows you to deal",
    "start": 3704.08,
    "duration": 5.84
  },
  {
    "text": "with infinities, because you can now construct functions that take infinitely many arguments in",
    "start": 3710.0,
    "duration": 4.96
  },
  {
    "text": "a single step, perform an operation over them in a single step, and give the result back in a single",
    "start": 3714.96,
    "duration": 5.28
  },
  {
    "text": "step. It's a language in which you can assign a value to pi. Right? In the computational system,",
    "start": 3720.24,
    "duration": 6.88
  },
  {
    "text": "you cannot really assign a value to pi. You can have a function that gives you digit by digit,",
    "start": 3727.12,
    "duration": 4.24
  },
  {
    "text": "but you never get to the latest last digit. It also means that pi can never be written down",
    "start": 3731.36,
    "duration": 6.48
  },
  {
    "text": "in such a way that you can have a process that relies on knowing all the digits of pi and consumes",
    "start": 3737.84,
    "duration": 4.96
  },
  {
    "text": "them to tune the outcome of some physical process. If you make the switch to a stateful language,",
    "start": 3742.8,
    "duration": 7.28
  },
  {
    "text": "in which you can only go from step to step, you're losing certain things. You're losing",
    "start": 3750.72,
    "duration": 5.2
  },
  {
    "text": "the ability to treat pi as a value. Pi is now suddenly a function that you can only approximate",
    "start": 3755.92,
    "duration": 5.6
  },
  {
    "text": "to a certain degree. And many other things stop being values. You get a fundamental difference",
    "start": 3761.52,
    "duration": 5.68
  },
  {
    "text": "between a value and a function. A value is something that you have already computed,",
    "start": 3767.2,
    "duration": 4.48
  },
  {
    "text": "that you know how to compute by extension. And this means that also that truth changes. Truth",
    "start": 3771.68,
    "duration": 5.44
  },
  {
    "text": "is no longer this platonic thing that precedes mathematics and where we can use mathematics as a",
    "start": 3777.12,
    "duration": 4.64
  },
  {
    "text": "tool to figure it out. It has to be contingent on the language in which you use it. If your language",
    "start": 3781.76,
    "duration": 6.88
  },
  {
    "text": "has internal contradictions, then truth becomes impossible to determine. Right? You get into",
    "start": 3788.64,
    "duration": 7.12
  },
  {
    "text": "areas in this language where it falls apart. You can no longer use it to express coherent",
    "start": 3795.76,
    "duration": 5.04
  },
  {
    "text": "thoughts about reality and coherent models about reality. You can never make statements in the",
    "start": 3800.8,
    "duration": 5.92
  },
  {
    "text": "language that you can prove outside of the language. So you cannot use your language to",
    "start": 3806.72,
    "duration": 4.24
  },
  {
    "text": "prove things that cannot be described in the language. Your only hope to prove statements",
    "start": 3810.96,
    "duration": 6.72
  },
  {
    "text": "about the universe that you exist in in a language is that you are able to recreate the observations",
    "start": 3817.68,
    "duration": 4.96
  },
  {
    "text": "that you make inside of the language, which means you recreate a model of the universe that is so",
    "start": 3822.64,
    "duration": 5.92
  },
  {
    "text": "good that it gives you what you observe currently. And then you can hope that the statements that you",
    "start": 3828.56,
    "duration": 6.72
  },
  {
    "text": "make in your language capture something about the reality outside of you that gives rise to",
    "start": 3835.28,
    "duration": 4.8
  },
  {
    "text": "your observations. Of course, you cannot know because it could also be different. But if your",
    "start": 3840.08,
    "duration": 5.04
  },
  {
    "text": "language is not able to produce what's on your screen, then your language is wrong. And Hilbert",
    "start": 3845.12,
    "duration": 7.28
  },
  {
    "text": "gave out this task to mathematicians to find a machine, any kind of structural sound language,",
    "start": 3853.28,
    "duration": 7.68
  },
  {
    "text": "that is able to run the semantics of mathematics without breaking. And what Gödel discovered is",
    "start": 3860.96,
    "duration": 4.96
  },
  {
    "text": "that the semantics of stateless mathematics cannot be recovered. If you assume that there is a",
    "start": 3865.92,
    "duration": 5.12
  },
  {
    "text": "solution to get stateless mathematics to work, you will run into contradictions of the way that Gödel",
    "start": 3871.04,
    "duration": 6.64
  },
  {
    "text": "discovered. But there is a way out. You just drop the notion of truth that is independent of the",
    "start": 3877.68,
    "duration": 8.24
  },
  {
    "text": "sequence of operations, the number of the set of steps that you took, the algorithm that you took,",
    "start": 3885.92,
    "duration": 5.2
  },
  {
    "text": "to get to your result. It means that when you have a self-referential statement like this sentence is",
    "start": 3891.12,
    "duration": 6.24
  },
  {
    "text": "false, right, this is a sentence that of the type that Gödel has shown leads into contradictions,",
    "start": 3897.36,
    "duration": 6.08
  },
  {
    "text": "if you assume that there is a stable notion of truth that is stateless. If you accept that truth",
    "start": 3903.44,
    "duration": 7.04
  },
  {
    "text": "is not necessarily a stable value and you look at the sentence, then as long as you look at it,",
    "start": 3910.48,
    "duration": 5.2
  },
  {
    "text": "the truth value will fluctuate. Because the assumption that the sentence is true will lead to",
    "start": 3916.48,
    "duration": 5.52
  },
  {
    "text": "the sentence being false and vice versa. So suddenly you have no longer a stable truth",
    "start": 3922.0,
    "duration": 4.64
  },
  {
    "text": "predicate. And it just means that the property of the languages in which you can actually deal",
    "start": 3926.64,
    "duration": 4.56
  },
  {
    "text": "with truth and assign it is that under some circumstances the truth predicate will not be stable.",
    "start": 3931.2,
    "duration": 5.28
  },
  {
    "text": "And it's fine. There's nothing wrong with that. And this same thing applies to the Entscheidungsproblem",
    "start": 3938.08,
    "duration": 6.08
  },
  {
    "text": "that Turing was dealing with when he came to the Harting problem. He defined originally the",
    "start": 3944.16,
    "duration": 6.08
  },
  {
    "text": "Turing machine in such a way that we could translate stateless mathematics into algorithms.",
    "start": 3950.24,
    "duration": 5.04
  },
  {
    "text": "And this might require that you have to go through an infinite sequence of steps.",
    "start": 3956.0,
    "duration": 3.44
  },
  {
    "text": "And if you make this assumption that you sometimes in order to get to truth you have",
    "start": 3959.76,
    "duration": 3.44
  },
  {
    "text": "to go through an infinite sequence of steps, you run into contradictions. So you might use an",
    "start": 3963.2,
    "duration": 6.8
  },
  {
    "text": "unbounded sequence of steps that gives you continuously results. That's fine. But you cannot",
    "start": 3970.0,
    "duration": 4.64
  },
  {
    "text": "accept that anything exists in any kind of universe that has causal structure that is going to produce",
    "start": 3974.64,
    "duration": 5.6
  },
  {
    "text": "you a solution to the Harting problem, which would give you back stateless mathematics.",
    "start": 3980.24,
    "duration": 4.48
  },
  {
    "text": "So basically what Gödel and Turing have shown is that stateless mathematics doesn't work.",
    "start": 3984.88,
    "duration": 5.2
  },
  {
    "text": "And when we look back at the history of mathematics, mathematicians have never used",
    "start": 3991.44,
    "duration": 3.6
  },
  {
    "text": "stateless mathematics. They only pretended to. Whenever they actually wanted to compute",
    "start": 3995.04,
    "duration": 4.48
  },
  {
    "text": "something with mathematics, they under the hood used stateful descriptions. They never took in",
    "start": 3999.52,
    "duration": 6.0
  },
  {
    "text": "infinitely many arguments and performed infinitely many operations on them. And the intuition",
    "start": 4005.52,
    "duration": 5.76
  },
  {
    "text": "and the intuition that stateless mathematics makes sense is because we had this intuition",
    "start": 4011.76,
    "duration": 5.28
  },
  {
    "text": "that continuity, that space and time in a continuous fashion exist. Why do we have this",
    "start": 4017.04,
    "duration": 5.6
  },
  {
    "text": "intuition? Well, that's pretty easy to answer, right? The number of things that we interact",
    "start": 4022.64,
    "duration": 4.4
  },
  {
    "text": "with, if we zoom in, we find that they are discrete. All our observations have a discrete",
    "start": 4027.04,
    "duration": 3.76
  },
  {
    "text": "resolution in time and in space. All our knowledge that we store about these observables is as a",
    "start": 4030.8,
    "duration": 7.76
  },
  {
    "text": "discrete number of bits that we can assign to them. There is only a finite number of information",
    "start": 4038.56,
    "duration": 6.88
  },
  {
    "text": "that we can access and that we can deal with as an observer that is embedded in this universe.",
    "start": 4045.44,
    "duration": 4.48
  },
  {
    "text": "So everything was discrete to begin with, but it's too many parts to count.",
    "start": 4049.92,
    "duration": 4.4
  },
  {
    "text": "If you deal with too many parts to count, the insight that a number of atoms that you are in",
    "start": 4055.6,
    "duration": 5.84
  },
  {
    "text": "an ocean is a finite bounded number doesn't help you at all because it's still almost infinite from",
    "start": 4061.44,
    "duration": 6.64
  },
  {
    "text": "the perspective of an observer. So when you want to describe what the ocean is doing, it doesn't help",
    "start": 4068.08,
    "duration": 4.32
  },
  {
    "text": "to count the molecules in it and to assign locations to them and model the interactions.",
    "start": 4072.4,
    "duration": 5.6
  },
  {
    "text": "It doesn't work. There is too much. So when you look at the dynamics of too many parts to count,",
    "start": 4078.0,
    "duration": 5.52
  },
  {
    "text": "you're looking for operations that converge in the limit, which means they behave quite similar",
    "start": 4083.52,
    "duration": 6.08
  },
  {
    "text": "whether you're using a trillion or 10 trillion or a gazillion particles. Once you have",
    "start": 4089.6,
    "duration": 6.16
  },
  {
    "text": "these operators that give you the same dynamics under all circumstances, when you take more and",
    "start": 4095.76,
    "duration": 5.68
  },
  {
    "text": "more elements to them, this part of mathematics that describes the convergent operators,",
    "start": 4101.44,
    "duration": 5.52
  },
  {
    "text": "that's geometry. And some of geometry is uncomputable, so you can only approximate it.",
    "start": 4107.52,
    "duration": 5.12
  },
  {
    "text": "But our brain has discovered geometry to deal with a world of too many parts to count.",
    "start": 4113.6,
    "duration": 4.08
  },
  {
    "text": "And this plays into what you're pointing out when you say that our perception doesn't give us",
    "start": 4118.4,
    "duration": 5.04
  },
  {
    "text": "reality, it gives us something that we can work with. Of course, the reality that we are embedded",
    "start": 4123.44,
    "duration": 5.92
  },
  {
    "text": "in has too many parts to count. We need a different reality. We need one that we can actually handle,",
    "start": 4129.36,
    "duration": 4.8
  },
  {
    "text": "even if it's not computable and can only be approximated. And this experiential reality is a",
    "start": 4134.16,
    "duration": 5.68
  },
  {
    "text": "very coarse simplification. It's about as coarse as a gaming engine is when you play a computer",
    "start": 4139.84,
    "duration": 5.2
  },
  {
    "text": "game as compared to real physics. It's not much better than that. In many ways, it's even worse,",
    "start": 4145.04,
    "duration": 5.52
  },
  {
    "text": "which you can verify if you put yourself into a lucid dream and look at the fidelity of what your",
    "start": 4150.56,
    "duration": 5.04
  },
  {
    "text": "brain is able to generate. Light switches will usually not work. You will not be able to read",
    "start": 4155.6,
    "duration": 4.16
  },
  {
    "text": "the same stuff twice on the same page when you imagine it and so on. There's only so many bits",
    "start": 4159.76,
    "duration": 4.72
  },
  {
    "text": "in your working memory. The fidelity of what your perceptual system can track and imagine is limited.",
    "start": 4164.48,
    "duration": 5.44
  },
  {
    "text": "It's relatively easy to overcome that. I don't really know what the number of bits in my working",
    "start": 4170.56,
    "duration": 4.0
  },
  {
    "text": "memory is, and I would be very curious to find out. But it's not as big as I thought when I was",
    "start": 4174.56,
    "duration": 5.52
  },
  {
    "text": "a child. It's not infinite. It's not unlimited. Perception of infinity is super easy to generate",
    "start": 4180.08,
    "duration": 5.28
  },
  {
    "text": "when your mind is very finite. It's super easy to overwhelm my finite resolution mind.",
    "start": 4185.36,
    "duration": 5.44
  },
  {
    "text": "So this deep thing that Gödel misunderstood, that Gödel has not discovered that mathematics cannot",
    "start": 4192.48,
    "duration": 6.4
  },
  {
    "text": "reach truth, but that truth is no more than the result of a sequence of steps that is compressing",
    "start": 4198.88,
    "duration": 6.72
  },
  {
    "text": "a statement to axioms losslessly. It doesn't go beyond that. That was the deep insight, and it's",
    "start": 4205.6,
    "duration": 5.68
  },
  {
    "text": "one that basically has not percolated in most areas of philosophy and even physics yet, because",
    "start": 4211.28,
    "duration": 5.2
  },
  {
    "text": "the physicists have checked out the code base for mathematics before that result was obtained and",
    "start": 4216.48,
    "duration": 4.88
  },
  {
    "text": "understood. So basically, we need to switch from continuous stateless mathematics to constructive",
    "start": 4221.36,
    "duration": 6.0
  },
  {
    "text": "mathematics that was not understood back then. And it needs to be understood now. So basically, my",
    "start": 4227.36,
    "duration": 7.52
  },
  {
    "text": "question to somebody like Donald would not be so much how to explain the spectral gap",
    "start": 4236.08,
    "duration": 5.28
  },
  {
    "text": "problem, because I think problems of this case, of this type, are with the result of using continuous",
    "start": 4241.36,
    "duration": 6.32
  },
  {
    "text": "notions of space-time and infinities and assuming them as given. So there's a statement about certain",
    "start": 4247.68,
    "duration": 6.56
  },
  {
    "text": "theories that are expressed in a language that has inconsistencies. And in this language, with these",
    "start": 4254.24,
    "duration": 6.16
  },
  {
    "text": "inconsistencies, you get to the point that you cannot get certain results. There's also an issue",
    "start": 4260.4,
    "duration": 5.12
  },
  {
    "text": "of computational irreducibility, which is difficult to understand in stateless mathematics.",
    "start": 4265.52,
    "duration": 5.36
  },
  {
    "text": "Computational irreducibility is a property of a system. That means that you cannot obtain the",
    "start": 4270.88,
    "duration": 5.68
  },
  {
    "text": "state of the system without running the system to that point. There is no way to predict the system",
    "start": 4276.56,
    "duration": 6.8
  },
  {
    "text": "except by taking the system, all its detail and fidelity, and going through the sequence of steps.",
    "start": 4284.32,
    "duration": 5.92
  },
  {
    "text": "So you cannot predict what the universe is going to do when the universe is computationally",
    "start": 4290.24,
    "duration": 5.12
  },
  {
    "text": "irreducible. You're going to predict some things, but not all of things. And these some things only",
    "start": 4295.36,
    "duration": 4.24
  },
  {
    "text": "with a certain degree of certainty, because you can often not insulate them from the parts that",
    "start": 4299.6,
    "duration": 5.52
  },
  {
    "text": "you cannot predict, because they are computationally irreducible. In a universe that is played out and",
    "start": 4305.12,
    "duration": 7.04
  },
  {
    "text": "implemented in a stateless language, that is a confusing property, because the cost of computation",
    "start": 4312.16,
    "duration": 5.52
  },
  {
    "text": "doesn't play a role when you are in a stateless universe. In a stateful universe, the number of",
    "start": 4317.68,
    "duration": 5.12
  },
  {
    "text": "state transitions that your model needs to make plays a certain role. And this spectra of",
    "start": 4322.8,
    "duration": 6.8
  },
  {
    "text": "computational irreducibility dooms large. It means that you cannot compute things for practical reasons,",
    "start": 4329.6,
    "duration": 5.68
  },
  {
    "text": "because you don't have enough information yet, and you cannot have information to make that",
    "start": 4335.84,
    "duration": 3.76
  },
  {
    "text": "prediction. But there is no deep miracle that is not caused by the language when you discover that",
    "start": 4339.6,
    "duration": 5.92
  },
  {
    "text": "the spectral gap problem is incomputable. So my question to Donald would be, if you think that",
    "start": 4345.52,
    "duration": 6.16
  },
  {
    "text": "there is a limit to computation that you can see, and beyond you would still do something and make",
    "start": 4351.68,
    "duration": 5.2
  },
  {
    "text": "statements, what is it that you use to make statements beyond the limits of computation?",
    "start": 4356.88,
    "duration": 4.64
  },
  {
    "text": "What parts of your mind are you drawing from when you make statements beyond what a computational",
    "start": 4362.16,
    "duration": 6.0
  },
  {
    "text": "system can derive? Right. So, well, one way of trying to focus this would be to talk about",
    "start": 4368.16,
    "duration": 9.68
  },
  {
    "text": "the integers versus the real numbers and the rational numbers. So from your point of view, Joscha,",
    "start": 4377.84,
    "duration": 6.88
  },
  {
    "text": "is it, do you think that, so for example, if we look at just the set of all functions from",
    "start": 4384.72,
    "duration": 9.44
  },
  {
    "text": "the integers to the integers, right, it's trivial to show that that's not countable.",
    "start": 4394.16,
    "duration": 5.04
  },
  {
    "text": "So, yet Turing showed that this set of computable functions is countable, the set of Turing",
    "start": 4402.24,
    "duration": 5.28
  },
  {
    "text": "machines is countable. So in that simple example, just to make things very, very concrete,",
    "start": 4407.52,
    "duration": 6.4
  },
  {
    "text": "the set of all functions from the integers to the integers isn't countable, the Turing",
    "start": 4415.04,
    "duration": 5.28
  },
  {
    "text": "computable functions are countable. And so there's a sense in which the Turing computable",
    "start": 4420.32,
    "duration": 4.64
  },
  {
    "text": "functions have measure zero. They have a, they're a probability zero in the set of all",
    "start": 4424.96,
    "duration": 4.64
  },
  {
    "text": "of all functions. So do we want to conclude from this computationalist point of view that",
    "start": 4429.6,
    "duration": 7.12
  },
  {
    "text": "all those other functions don't exist, that we're sort of, when I, so you're saying those functions,",
    "start": 4437.92,
    "duration": 5.84
  },
  {
    "text": "so real numbers don't exist. Real numbers don't. Yes, for something to exist, it has to",
    "start": 4443.76,
    "duration": 5.84
  },
  {
    "text": "be implemented. If it's something is not implemented anywhere, it doesn't make sense",
    "start": 4449.6,
    "duration": 4.24
  },
  {
    "text": "to claim that it exists. I think it's a confusion of the notion of existence to say that something",
    "start": 4453.84,
    "duration": 4.56
  },
  {
    "text": "that is not implemented and is not implementable could exist. The things that produce patterns",
    "start": 4458.4,
    "duration": 5.76
  },
  {
    "text": "that we observe in order to exist, they need to be implemented, right? So you could say,",
    "start": 4464.16,
    "duration": 5.68
  },
  {
    "text": "does the financial system exist? Well, it exists to the degree that it's implemented.",
    "start": 4469.84,
    "duration": 3.92
  },
  {
    "text": "There are some boundaries where we project it and it's not actually implemented and where it",
    "start": 4473.76,
    "duration": 3.52
  },
  {
    "text": "doesn't actually exist only in some cause approximation, but by and large, something",
    "start": 4477.28,
    "duration": 4.88
  },
  {
    "text": "exists, right? Some causal structure is implemented here. The set of all the functions between the",
    "start": 4482.16,
    "duration": 5.68
  },
  {
    "text": "integers is not implementable. Therefore, it doesn't exist. It's something that you can",
    "start": 4487.84,
    "duration": 4.88
  },
  {
    "text": "specify. And this difference between specification and existence is something that is very obvious",
    "start": 4492.72,
    "duration": 6.24
  },
  {
    "text": "to a computer scientist and sometimes not obvious to a traditional mathematician.",
    "start": 4498.96,
    "duration": 4.4
  },
  {
    "text": "There is stuff that you can specify that makes no sense. It is only specifiable in your language,",
    "start": 4504.0,
    "duration": 5.2
  },
  {
    "text": "but that's because your language is much more permissible than the set of things that can exist.",
    "start": 4509.2,
    "duration": 6.56
  },
  {
    "text": "And computation is less permissible. Computation only permits you to build things that can actually",
    "start": 4515.76,
    "duration": 5.68
  },
  {
    "text": "exist. If you can build things that cannot exist, it's a problem of your language in which you're",
    "start": 4521.44,
    "duration": 4.32
  },
  {
    "text": "building things. It's not a problem of reality. Just confused. I have a comment. This one's from",
    "start": 4525.76,
    "duration": 6.0
  },
  {
    "text": "Professor Edward Lee of Berkeley, and it may provide some insight and you both can tell us",
    "start": 4531.76,
    "duration": 5.6
  },
  {
    "text": "your thoughts on this. So this is from Professor Edward Lee of Berkeley. This question is a major",
    "start": 4537.36,
    "duration": 4.4
  },
  {
    "text": "theme in the second half of my book, Plato and the Nerd. UTMs, so universal Turing machines,",
    "start": 4541.76,
    "duration": 4.96
  },
  {
    "text": "have the following properties. Number one, their operation is a sequence of discrete steps. Number",
    "start": 4546.72,
    "duration": 4.4
  },
  {
    "text": "two, the data comes from a countable set. Number three, that sequence terminates. It is a huge leap",
    "start": 4551.12,
    "duration": 5.12
  },
  {
    "text": "of faith to assume that physical processes have any of these constraints. I show in Plato and the",
    "start": 4556.24,
    "duration": 6.56
  },
  {
    "text": "Nerd that the hypothesis that physical processes all have these properties is actually untestable.",
    "start": 4562.8,
    "duration": 5.76
  },
  {
    "text": "I remember earlier, Joscha, you mentioned that if it's untestable and you can't provide evidence for",
    "start": 4568.56,
    "duration": 6.08
  },
  {
    "text": "it, then perhaps it shouldn't be talked about. So this reminded me of this. And he says in brackets,",
    "start": 4574.64,
    "duration": 4.08
  },
  {
    "text": "this follows from an information theorem due to Claude Shannon known as the channel capacity",
    "start": 4578.72,
    "duration": 4.4
  },
  {
    "text": "theorem. The converse hypothesis that the physical world is not so constrained is also",
    "start": 4583.12,
    "duration": 5.52
  },
  {
    "text": "untestable by experiment. But I argue in Plato and the Nerd that the converse hypothesis leads",
    "start": 4588.64,
    "duration": 6.24
  },
  {
    "text": "to simpler models of the universe and therefore is a better choice by Occam's razor. My claim is",
    "start": 4594.88,
    "duration": 4.8
  },
  {
    "text": "that universal Turing machines as realized on today's computers are simulations, quote unquote,",
    "start": 4599.68,
    "duration": 4.56
  },
  {
    "text": "of a process that is fundamentally non-algorithmic. So I just want to place that out there and",
    "start": 4604.24,
    "duration": 4.64
  },
  {
    "text": "perhaps you can use that as a jumping off board, Donald and then Joscha.",
    "start": 4608.88,
    "duration": 3.36
  },
  {
    "text": "Very interesting. I'll want to read that book and make sure I understand what Professor Lee is",
    "start": 4614.16,
    "duration": 4.64
  },
  {
    "text": "saying. That's quite interesting. So Plato and the Nerd. I'll be interviewing Edward at some",
    "start": 4618.8,
    "duration": 5.28
  },
  {
    "text": "point in the next few weeks as well. Oh, very good. Yeah. That's really",
    "start": 4624.08,
    "duration": 4.72
  },
  {
    "text": "quick because these are very, very deep issues. It seems to me that this also interacts with what",
    "start": 4628.8,
    "duration": 5.2
  },
  {
    "text": "the physicists are telling us that there is no time fundamentally. So if time is not fundamental,",
    "start": 4634.0,
    "duration": 8.48
  },
  {
    "text": "then these computational issues where there are fundamental limits to what can be computed because",
    "start": 4642.48,
    "duration": 8.48
  },
  {
    "text": "we're assuming time, a sequence of... So in computer simulations, computer algorithms,",
    "start": 4650.96,
    "duration": 7.68
  },
  {
    "text": "we're assuming a sequence in time of computations that can be... And the kinds of",
    "start": 4659.2,
    "duration": 6.32
  },
  {
    "text": "limits that Joscha is talking about, it seems to me, are a consequence of assuming time to",
    "start": 4665.52,
    "duration": 7.28
  },
  {
    "text": "be fundamental. And if we have to go to a physics in which time is not fundamental,",
    "start": 4672.8,
    "duration": 4.48
  },
  {
    "text": "then that places this whole conversation in a completely different context. And so",
    "start": 4677.84,
    "duration": 6.0
  },
  {
    "text": "what we may be pointing to is time has been a very useful and helpful thing for physics for",
    "start": 4684.08,
    "duration": 6.8
  },
  {
    "text": "several centuries. And now the hard work that we have to do is to understand how to go beyond the",
    "start": 4690.88,
    "duration": 5.6
  },
  {
    "text": "notion of time. And when we go beyond the notion of time, will the kind of discussion we're having",
    "start": 4696.48,
    "duration": 4.64
  },
  {
    "text": "right now be fundamentally revised? The computational versus non-computational",
    "start": 4701.12,
    "duration": 5.6
  },
  {
    "text": "notions, we may have to really revise how our whole conversation is going to be.",
    "start": 4706.72,
    "duration": 5.52
  },
  {
    "text": "Our whole conversation here is going. I'd be very interested in what Joscha has to say on that.",
    "start": 4712.64,
    "duration": 4.24
  },
  {
    "text": "Thank you. Also, thanks, Edward Lee, for your argument. I concur with you that it's in principle",
    "start": 4719.2,
    "duration": 10.16
  },
  {
    "text": "not testable what physics is really like. What we can only say is which theory that we can come up",
    "start": 4729.36,
    "duration": 6.96
  },
  {
    "text": "with is more elegant. A small thing, I think that this notion that the Turing machine has to get to",
    "start": 4736.4,
    "duration": 7.92
  },
  {
    "text": "result after a finite sequence of steps might be a mistake in the sense in which Turing machines",
    "start": 4744.32,
    "duration": 5.92
  },
  {
    "text": "were originally defined. So basically, a computer that can be built is not a Turing machine in this",
    "start": 4750.24,
    "duration": 7.2
  },
  {
    "text": "sense, but it's always a finite state machine. And in a finite state machine, you can have a",
    "start": 4757.44,
    "duration": 7.92
  },
  {
    "text": "sequence of steps that is unbounded, that doesn't stop, and that gives you more and more digits of",
    "start": 4766.16,
    "duration": 6.0
  },
  {
    "text": "pi while you're looking at. In a sense, it doesn't come to a conclusion if you want to compute",
    "start": 4772.16,
    "duration": 5.6
  },
  {
    "text": "physics, but it's not a problem to build a computer that as long as it runs gives you more digits of",
    "start": 4777.76,
    "duration": 4.8
  },
  {
    "text": "pi. And so I think from a formal perspective, it doesn't make much of a difference because you can",
    "start": 4782.56,
    "duration": 6.24
  },
  {
    "text": "easily fix it. But it's important if you think about your intuitions about how things work or",
    "start": 4788.8,
    "duration": 4.96
  },
  {
    "text": "the proofs that you make in other contexts that the value of computation doesn't hinge on there",
    "start": 4793.76,
    "duration": 5.92
  },
  {
    "text": "being a finite number of steps until a computation that is going to give you a result that was",
    "start": 4799.68,
    "duration": 5.2
  },
  {
    "text": "formulated in classical mathematics terminates. But that it means that everything that you get",
    "start": 4804.88,
    "duration": 5.76
  },
  {
    "text": "is the result of finite interactions. And if you assume that infinite interactions are possible,",
    "start": 4810.64,
    "duration": 7.52
  },
  {
    "text": "you run into the difficulties that Gödel and Turing have discovered, which means that your",
    "start": 4818.16,
    "duration": 4.48
  },
  {
    "text": "theories no longer work. They no longer make sense. And different from Edward, and maybe I'm",
    "start": 4822.64,
    "duration": 6.72
  },
  {
    "text": "doing him injustice here, I haven't read this book, is so I would say that it's much more elegant from",
    "start": 4829.36,
    "duration": 7.36
  },
  {
    "text": "the perspective of Horkheim's razor to describe reality in a language that doesn't break.",
    "start": 4836.72,
    "duration": 3.52
  },
  {
    "text": "Because if your language breaks and you still try to make a model of reality, it's going to be",
    "start": 4841.28,
    "duration": 5.2
  },
  {
    "text": "arbitrarily expensive. It doesn't work. You have to find a language that works. So if we find that",
    "start": 4846.48,
    "duration": 5.68
  },
  {
    "text": "the languages in which we can describe reality have to be computational languages because the",
    "start": 4852.16,
    "duration": 5.36
  },
  {
    "text": "others lead into contradictions, then we have to use the computational languages. That's the",
    "start": 4857.52,
    "duration": 4.48
  },
  {
    "text": "situation that I find myself to be in. This doesn't mean that I can know what physics is like. It just",
    "start": 4862.0,
    "duration": 5.36
  },
  {
    "text": "means that all the physics that I can talk about without my language breaking has to play out in",
    "start": 4867.36,
    "duration": 4.88
  },
  {
    "text": "this way. The notion of what is time, so coming back to Donald, is very important. There are two",
    "start": 4872.24,
    "duration": 8.56
  },
  {
    "text": "notions of time. One is this intuitive notion that we have as human beings, which is basically",
    "start": 4880.8,
    "duration": 6.8
  },
  {
    "text": "this Newtonian time, this time where clocks run the same speed everywhere and so on. And it",
    "start": 4887.6,
    "duration": 6.56
  },
  {
    "text": "describes the transition of the universe from the past into the future via the present.",
    "start": 4894.16,
    "duration": 4.4
  },
  {
    "text": "And this notion of time is somewhat similar to the notion of the state transition in your",
    "start": 4900.0,
    "duration": 5.68
  },
  {
    "text": "computer, except that the state transition in a computer has some kind of global clock where",
    "start": 4905.68,
    "duration": 4.88
  },
  {
    "text": "everything in the computer goes from state to state all at once and progresses to the next step.",
    "start": 4910.56,
    "duration": 5.6
  },
  {
    "text": "But what we see in our universe is that it only makes sense if we assume that it's dynamic.",
    "start": 4916.16,
    "duration": 4.24
  },
  {
    "text": "If the universe would just be a decoupled sequence of states without a transition function, there",
    "start": 4921.28,
    "duration": 4.88
  },
  {
    "text": "would not be any law that we can discover. There is nothing that we can control. Organisms would",
    "start": 4926.16,
    "duration": 4.8
  },
  {
    "text": "not exist in the way in which they do. So from the observations that we make, we have to assume",
    "start": 4930.96,
    "duration": 5.92
  },
  {
    "text": "that the transitions in the universe are somehow fundamental, that the universe is moving. And state",
    "start": 4936.88,
    "duration": 6.0
  },
  {
    "text": "transitions seem to be crucial in order to be able to understand the universe. But there is some",
    "start": 4942.88,
    "duration": 4.72
  },
  {
    "text": "notion of transition, and this notion of transition is much more basic than time. And the time that",
    "start": 4947.6,
    "duration": 6.48
  },
  {
    "text": "we are talking about when we see that time is not fundamental in the notion of spacetime is relativistic",
    "start": 4954.08,
    "duration": 4.88
  },
  {
    "text": "time. The relativistic time is what the universe looks like to a relativistic observer.",
    "start": 4958.96,
    "duration": 5.36
  },
  {
    "text": "And we can obtain relativistic time if we understand that what we perceive as time is",
    "start": 4965.52,
    "duration": 6.48
  },
  {
    "text": "basically the speed of the clocks in our environment. And the speed of the clocks that",
    "start": 4972.0,
    "duration": 5.28
  },
  {
    "text": "we observe depend on our own speed. So if I move you through the universe and you are a supervenient",
    "start": 4977.28,
    "duration": 6.56
  },
  {
    "text": "pattern on the structure of the universe, imagine the universe is something like an ocean. And the",
    "start": 4983.84,
    "duration": 7.12
  },
  {
    "text": "present is the crest of a traveling wave through that ocean. And there are waves maybe in front",
    "start": 4990.96,
    "duration": 8.08
  },
  {
    "text": "and behind us, but they're not our future, they're past, they're different universes that just happen",
    "start": 4999.04,
    "duration": 4.72
  },
  {
    "text": "to be a little more along or a bit less along. The future and past would require you to leave the",
    "start": 5003.76,
    "duration": 4.8
  },
  {
    "text": "crest of the wave, and you can't because you're always traveling with the wave. So there is no",
    "start": 5008.56,
    "duration": 5.2
  },
  {
    "text": "way to leave that present because only the present exists from the perspective of that crest.",
    "start": 5013.76,
    "duration": 4.8
  },
  {
    "text": "And you and me, we are vortices inscribed on the crest of that traveling wave. And the rotation",
    "start": 5018.56,
    "duration": 7.84
  },
  {
    "text": "that the vortex is doing when it updates itself to observe the universe, to form a memory, and so on,",
    "start": 5026.4,
    "duration": 4.96
  },
  {
    "text": "and to register its perceptions, and so on, will depend on the speed in which this vortex rotates.",
    "start": 5031.36,
    "duration": 4.96
  },
  {
    "text": "And so if the vortex is moving along with the wave, then the updates in the vortex are a",
    "start": 5037.28,
    "duration": 6.8
  },
  {
    "text": "function of the movement in the wave itself, the basic parasitize on the movement of the main wave.",
    "start": 5044.08,
    "duration": 4.8
  },
  {
    "text": "And you cannot, as this vortex traveling with the wave, ever leave the wave. You can move a little",
    "start": 5050.0,
    "duration": 4.96
  },
  {
    "text": "bit in the wave to the left or to the right. That is, moving to the left or to the right would be",
    "start": 5054.96,
    "duration": 5.92
  },
  {
    "text": "movement in space. You cannot move in time. You just move with the time. And the faster you move",
    "start": 5060.88,
    "duration": 6.0
  },
  {
    "text": "to the left or to the right, the less there will be updates available for turning up internal state.",
    "start": 5066.88,
    "duration": 5.36
  },
  {
    "text": "So the fluctuations of the vortex becomes slower and slower the more the vortex moves in space.",
    "start": 5073.84,
    "duration": 6.0
  },
  {
    "text": "And this leads to relativistic time. It means that from the perspective of the vortex, when it looks",
    "start": 5079.84,
    "duration": 5.12
  },
  {
    "text": "at its environment, the environment gets distorted in time and space. So in this notion, we realize",
    "start": 5084.96,
    "duration": 5.68
  },
  {
    "text": "why something would look like to a vortex that moves like this, like relativistic time. And we",
    "start": 5090.96,
    "duration": 5.12
  },
  {
    "text": "understand that the relativistic time, from the fundamental perspective, how to make all this",
    "start": 5096.08,
    "duration": 4.88
  },
  {
    "text": "happening, how to build a system that functions like this, cannot be fundamental. It's a result",
    "start": 5100.96,
    "duration": 5.52
  },
  {
    "text": "to the observer. It will be what the universe looks like to the observer of the observer's",
    "start": 5106.48,
    "duration": 4.96
  },
  {
    "text": "screens, as we always do. But it is not fundamental. What's fundamental are the state transitions.",
    "start": 5111.44,
    "duration": 6.0
  },
  {
    "text": "So what we need to do is basically replace the physicalist time that is relativistic for good",
    "start": 5117.76,
    "duration": 5.6
  },
  {
    "text": "reason in the frame of certain models by something that is more fundamental and allows us to derive",
    "start": 5123.36,
    "duration": 5.6
  },
  {
    "text": "the relativistic time. And this would be state transitions. Very interesting. There's some,",
    "start": 5128.96,
    "duration": 6.4
  },
  {
    "text": "in that spirit, or at least in that kind of direction, there's work by Marcus Mueller and",
    "start": 5136.24,
    "duration": 5.68
  },
  {
    "text": "Philip Hohn, and then also some more recent work by Favio Mercati and Giovanni Emiliano Camiglia,",
    "start": 5141.92,
    "duration": 12.16
  },
  {
    "text": "where they're showing how relativistic space times can be constructed from exchange of",
    "start": 5154.8,
    "duration": 8.72
  },
  {
    "text": "quantum information. So you don't assume it up front, but you try to get a dictionary",
    "start": 5163.52,
    "duration": 3.84
  },
  {
    "text": "that allows different quantum agents to send information back and forth. And it turns out",
    "start": 5167.92,
    "duration": 10.72
  },
  {
    "text": "if you send enough information back and forth and try to set up a dictionary to make everything",
    "start": 5178.64,
    "duration": 4.08
  },
  {
    "text": "consistent, you will get Einstein's special relativistic space time coming out of it. So",
    "start": 5182.72,
    "duration": 5.92
  },
  {
    "text": "that's an interesting direction to go. Another interesting direction to think about,",
    "start": 5189.6,
    "duration": 8.4
  },
  {
    "text": "just a simple notion, time and entropy, or at least physical time and entropy are deeply connected.",
    "start": 5198.72,
    "duration": 7.92
  },
  {
    "text": "And so we would like to have some way of getting entropic time coming out of a deeper system in",
    "start": 5208.0,
    "duration": 7.52
  },
  {
    "text": "which there is no entropic time. And I'm not saying this is the deepest way of doing it,",
    "start": 5215.6,
    "duration": 6.48
  },
  {
    "text": "but an interesting simple way, just in the case of Markovian dynamics. So if I have a Markovian",
    "start": 5222.08,
    "duration": 6.56
  },
  {
    "text": "system, homogeneous, and it's in a stationary, then the entropy of that system doesn't change.",
    "start": 5228.64,
    "duration": 9.12
  },
  {
    "text": "So if for state X sub N and X N minus one and so forth, the entropy H of X sub N equals H of X",
    "start": 5238.32,
    "duration": 10.08
  },
  {
    "text": "sub N minus one for all N. So there is no entropic time, but it's trivial to prove",
    "start": 5248.4,
    "duration": 9.2
  },
  {
    "text": "that if you just do a simple conditioning, if I look at X N given X one or X N given,",
    "start": 5258.16,
    "duration": 7.92
  },
  {
    "text": "then it turns out that H of X N given X one is greater than or equal to H of X N given X N minus",
    "start": 5266.08,
    "duration": 8.48
  },
  {
    "text": "one. In other words, the very fact of doing conditioning, which is projection. So you can",
    "start": 5274.56,
    "duration": 7.92
  },
  {
    "text": "think about, I take this dynamical system, which has a notion of state transition, it's a Markov",
    "start": 5282.48,
    "duration": 7.04
  },
  {
    "text": "chain, but it doesn't have any entropic time. But as soon as you start projecting that nonentropic",
    "start": 5289.52,
    "duration": 6.8
  },
  {
    "text": "system onto different perspectives by conditioning H of X N given X one, all of a sudden, now you",
    "start": 5296.32,
    "duration": 6.64
  },
  {
    "text": "have entropy. And so now you have that kind of notion of time. So is that a direction that we",
    "start": 5302.96,
    "duration": 5.28
  },
  {
    "text": "could go where we could still have, in some sense, a dynamical system, but it's not an entropic time",
    "start": 5308.24,
    "duration": 7.12
  },
  {
    "text": "system and show how we get space time arising from that in the way that some of these",
    "start": 5315.36,
    "duration": 8.16
  },
  {
    "text": "physicists are trying to do. I think that will be interesting. I think that it's a separate",
    "start": 5323.52,
    "duration": 6.24
  },
  {
    "text": "question whether the real numbers exist versus, that's, it's a pretty strong statement to say",
    "start": 5329.76,
    "duration": 6.8
  },
  {
    "text": "that real numbers don't exist. That's really quite interesting to say that they don't exist,",
    "start": 5336.56,
    "duration": 5.44
  },
  {
    "text": "but I guess that's where you want to go anyway. Yeah, well, I agree with Pythagoras that real",
    "start": 5342.56,
    "duration": 6.0
  },
  {
    "text": "numbers don't exist. And the time was not right back then. So real numbers are actually functions.",
    "start": 5348.56,
    "duration": 5.68
  },
  {
    "text": "And you can, I can give you this function instead of a real number and it can give you as many",
    "start": 5355.12,
    "duration": 4.88
  },
  {
    "text": "digits as you want, or as you can afford to compute, but this is it. And it's fine. So basically,",
    "start": 5360.0,
    "duration": 5.76
  },
  {
    "text": "real numbers can be derived in a deterministic fashion. They are determined once they are",
    "start": 5365.76,
    "duration": 7.52
  },
  {
    "text": "predetermined in the sense, but you will not know the billionth digit of the square root of two,",
    "start": 5373.28,
    "duration": 8.72
  },
  {
    "text": "unless you find a procedure to compute it and the energy or the neck entropy to actually get there.",
    "start": 5382.0,
    "duration": 9.04
  },
  {
    "text": "And this derivation of a result via using apneic entropy, I think, relates to our perception of",
    "start": 5391.6,
    "duration": 7.44
  },
  {
    "text": "time. This causal arrow of time, which is aligned with the entropic arrow. Eric Drescher finds a",
    "start": 5399.04,
    "duration": 5.76
  },
  {
    "text": "very good metaphor in his book, Good and Real, I think, to give an intuition how a symmetric system,",
    "start": 5404.8,
    "duration": 5.6
  },
  {
    "text": "where the transitions are symmetric in both directions, is still not going to be symmetric",
    "start": 5412.32,
    "duration": 6.4
  },
  {
    "text": "at scale when you look at it. So he takes as an example, a world that is made of large and small",
    "start": 5418.72,
    "duration": 5.28
  },
  {
    "text": "billiard balls. And you put one of these billiard balls in motion and the transaction between the",
    "start": 5424.0,
    "duration": 8.32
  },
  {
    "text": "billiard balls are all symmetrical, which means if you take a movie and you play it forward and",
    "start": 5432.32,
    "duration": 4.72
  },
  {
    "text": "backward, you will see for every interaction between two billiard balls that it's the same",
    "start": 5437.04,
    "duration": 5.84
  },
  {
    "text": "if you go the movie backwards or forwards. It's a simplified model where you have no friction.",
    "start": 5442.88,
    "duration": 4.32
  },
  {
    "text": "And so we have no thermodynamic stuff going on. We look at the universe at the level where",
    "start": 5447.84,
    "duration": 5.76
  },
  {
    "text": "thermodynamics doesn't exist yet, because maybe the stuff is too small to have these losses.",
    "start": 5453.6,
    "duration": 5.28
  },
  {
    "text": "So we just look at the billiard ball universe where everything is deterministic and without",
    "start": 5458.88,
    "duration": 5.52
  },
  {
    "text": "noise. And in this model, what we see is that when we zoom out, there is something that is happening",
    "start": 5464.4,
    "duration": 6.48
  },
  {
    "text": "at scale. And that is some balls move after they have been hit and keep hitting other balls.",
    "start": 5471.44,
    "duration": 8.08
  },
  {
    "text": "And if you play the movie backwards, it looks as if some balls are anticipating that they are going",
    "start": 5480.96,
    "duration": 5.28
  },
  {
    "text": "to be soon hit and start moving as a result, as if they would be hit. So there is this asymmetry",
    "start": 5486.24,
    "duration": 7.04
  },
  {
    "text": "that your balls leave a wake behind them. And this wake is describing in some sense the entropy",
    "start": 5493.28,
    "duration": 9.12
  },
  {
    "text": "that we are looking at in our universe. That's the direction in which you can, as an embedded",
    "start": 5502.4,
    "duration": 4.24
  },
  {
    "text": "observer, form memories. Because in order to form memories, you rely on the dissipation of",
    "start": 5506.64,
    "duration": 5.52
  },
  {
    "text": "information between locations. And so whenever there is a way to form memories, it means that",
    "start": 5512.16,
    "duration": 6.72
  },
  {
    "text": "you are aligned with some kind of entropic arrow. If you zoom out, it means that you can now sort",
    "start": 5518.88,
    "duration": 5.76
  },
  {
    "text": "the states of the universe in such a way that you discover the concentric wave that you are part of",
    "start": 5524.64,
    "duration": 5.44
  },
  {
    "text": "in our ocean-like universe has a point of origin. And this point of origin is a construction that",
    "start": 5530.08,
    "duration": 7.12
  },
  {
    "text": "you make. You discover this by the wave expanding. And you discover it by information moving,",
    "start": 5537.2,
    "duration": 6.16
  },
  {
    "text": "diffusing across the locations in the wave. So there is a hypothetical point",
    "start": 5543.36,
    "duration": 4.56
  },
  {
    "text": "in the middle where the information is not diffused yet.",
    "start": 5549.68,
    "duration": 3.36
  },
  {
    "text": "And this hypothetical point is what we imagine to be the Big Bang.",
    "start": 5555.12,
    "duration": 3.6
  },
  {
    "text": "And it's a mathematical singularity in a way, because if you are in the Big Bang,",
    "start": 5560.48,
    "duration": 4.96
  },
  {
    "text": "you don't know which direction to go unless the Big Bang is not completely perfect and symmetrical.",
    "start": 5565.44,
    "duration": 4.32
  },
  {
    "text": "And the interesting thing about this before the Big Bang means it's the wrong question to ask,",
    "start": 5570.48,
    "duration": 6.08
  },
  {
    "text": "because before the Big Bang, if you looked at it, it's like a moire pattern. This would be the point",
    "start": 5576.56,
    "duration": 6.8
  },
  {
    "text": "where the information goes out of distribution or gets distributed or diffuses between locations in",
    "start": 5583.36,
    "duration": 5.36
  },
  {
    "text": "the other direction. Every point of every trajectory that goes away from the Big Bang",
    "start": 5588.72,
    "duration": 6.0
  },
  {
    "text": "goes into a future. Sorry to interrupt. Is this related to the Janus point?",
    "start": 5594.72,
    "duration": 3.36
  },
  {
    "text": "Have you heard of Julian Barber's theory of time?",
    "start": 5598.88,
    "duration": 2.24
  },
  {
    "text": "No. No, but it's an artifact of a certain description. Basically, we create a certain",
    "start": 5601.68,
    "duration": 5.84
  },
  {
    "text": "mental model in which we describe the entropic arrow of time as the diffusion of information",
    "start": 5607.52,
    "duration": 7.76
  },
  {
    "text": "across locations in the universe. And then we imagine that there is a single point where this",
    "start": 5615.28,
    "duration": 4.8
  },
  {
    "text": "ends up. And if you go through this point on the other side, you go back into another future.",
    "start": 5620.08,
    "duration": 4.08
  },
  {
    "text": "So the further we go away from this point in any direction, the further we go into a future",
    "start": 5624.88,
    "duration": 5.6
  },
  {
    "text": "in which systems could form memories of the past. And to form memories of the past,",
    "start": 5630.48,
    "duration": 4.32
  },
  {
    "text": "you need to have some kind of reservoir of neck entropy that you can tap and some kind of",
    "start": 5634.8,
    "duration": 4.24
  },
  {
    "text": "puddle of neck entropy. And then you can reason about the conditions, how such puddles of neck",
    "start": 5639.04,
    "duration": 5.44
  },
  {
    "text": "entropy could form, under which conditions, and how long they might last. I would like to get to",
    "start": 5644.48,
    "duration": 5.2
  },
  {
    "text": "the topic of free will as well, and then also some audience questions. So why don't you, Donald,",
    "start": 5649.68,
    "duration": 4.8
  },
  {
    "text": "outline your views on free will? Okay. Yeah. If in a physicalist framework,",
    "start": 5654.48,
    "duration": 14.96
  },
  {
    "text": "which... So now I'll just talk about what most of my cognitive neuroscience peers think. Most of",
    "start": 5670.72,
    "duration": 6.72
  },
  {
    "text": "them assume that physical systems are fundamental. Neural activity causes all of our behavior.",
    "start": 5677.52,
    "duration": 7.36
  },
  {
    "text": "And in that case, there can be a fiction of... A useful fiction of free will, but it's really",
    "start": 5685.84,
    "duration": 10.08
  },
  {
    "text": "just going to be a useful fiction. If I do something, it's really my neurons with the",
    "start": 5695.92,
    "duration": 4.32
  },
  {
    "text": "neural activity that did it. And there is a sense in which you can say, I chose to do it because",
    "start": 5700.24,
    "duration": 7.12
  },
  {
    "text": "neurons are part of me. So I think that's the point of view that Dan Dennett takes, for example,",
    "start": 5707.92,
    "duration": 6.08
  },
  {
    "text": "on this. And Sam Harris replies on that. He says, well, yeah, I also grow my fingernails. I'm not",
    "start": 5714.0,
    "duration": 8.48
  },
  {
    "text": "sure that I'm doing that by free will. So it's not real clear that just because my neurons are",
    "start": 5722.48,
    "duration": 6.48
  },
  {
    "text": "doing it, I have free will, just in the same sense that I'm not using free will to grow my fingernails.",
    "start": 5728.96,
    "duration": 5.04
  },
  {
    "text": "So Sam would say there's no such thing as free will, if you're a physicalist. Dan Dennett would",
    "start": 5734.96,
    "duration": 7.68
  },
  {
    "text": "say I'm a physicalist and there is this important notion of free will. I think that, of course,",
    "start": 5742.64,
    "duration": 9.84
  },
  {
    "text": "space-time isn't fundamental. And so that we have to completely think outside of that box",
    "start": 5752.48,
    "duration": 4.64
  },
  {
    "text": "altogether. And as scientists, we have to say up front what our hypotheses, what our axioms or",
    "start": 5757.12,
    "duration": 8.72
  },
  {
    "text": "fundamental assumptions are and be very clear about them up front. These conscious agents",
    "start": 5765.84,
    "duration": 7.76
  },
  {
    "text": "in the mathematics, they get certain inputs. We can call them experiences that they have.",
    "start": 5774.4,
    "duration": 5.52
  },
  {
    "text": "And then there's something called the Markovian kernel that describes what actions they take.",
    "start": 5780.56,
    "duration": 6.08
  },
  {
    "text": "And those actions affect the experiences of other conscious agents. So that's just the mathematics",
    "start": 5786.72,
    "duration": 6.0
  },
  {
    "text": "that my team has written down. It's a very simple notion of a Markovian dynamics of conscious agents",
    "start": 5792.72,
    "duration": 4.88
  },
  {
    "text": "interacting. And it's not in physicalist framework. We're assuming that this is in its own world.",
    "start": 5797.6,
    "duration": 7.76
  },
  {
    "text": "These are conscious agents and that's the foundation. Space and time are not the",
    "start": 5805.92,
    "duration": 4.0
  },
  {
    "text": "foundation, conscious agents. So conscious experiences and interactions of conscious",
    "start": 5809.92,
    "duration": 4.48
  },
  {
    "text": "agents are the foundational notion. And so then the question is, how shall we understand",
    "start": 5814.4,
    "duration": 7.68
  },
  {
    "text": "the probability? So if I get a particular experience that comes into a conscious agent",
    "start": 5822.8,
    "duration": 5.2
  },
  {
    "text": "and it then probabilistically affects the experience of other agents, how shall I",
    "start": 5828.8,
    "duration": 4.56
  },
  {
    "text": "understand that probability? Shall I understand it as a free will choice or what?",
    "start": 5833.92,
    "duration": 8.72
  },
  {
    "text": "And I could say, I refuse to answer the question. There's a probability there and that's as far as",
    "start": 5844.4,
    "duration": 9.04
  },
  {
    "text": "I go with the theory. There's this agent. So I leave that probability as just where my theory",
    "start": 5853.44,
    "duration": 7.28
  },
  {
    "text": "stops. I say, in some sense, wherever we see a probability in a theory, that's where explanation",
    "start": 5860.72,
    "duration": 6.08
  },
  {
    "text": "stops. That's basically saying, I don't know. So I would say this, whenever in a scientific theory,",
    "start": 5866.8,
    "duration": 9.68
  },
  {
    "text": "you see probabilities coming up, you're seeing the theory say, this is where I halt.",
    "start": 5876.48,
    "duration": 6.32
  },
  {
    "text": "This is where my explanation stops. And there are two major",
    "start": 5883.52,
    "duration": 4.0
  },
  {
    "text": "approaches toward understanding those probabilities, the objectivist and subjectivist",
    "start": 5889.92,
    "duration": 3.76
  },
  {
    "text": "to probabilities. So objectivists say that these probabilities are",
    "start": 5894.24,
    "duration": 4.24
  },
  {
    "text": "pointing to some real thing in the world. There is some real random generator in the world.",
    "start": 5899.92,
    "duration": 7.44
  },
  {
    "text": "And subjectivists say, no, these are just degrees of belief. Whenever you see probabilities,",
    "start": 5909.76,
    "duration": 6.0
  },
  {
    "text": "you're only talking about degrees of belief. But in either case,",
    "start": 5916.72,
    "duration": 6.88
  },
  {
    "text": "explanation stops. How do I come to that belief? Well, I can only tell you probabilities.",
    "start": 5925.92,
    "duration": 4.88
  },
  {
    "text": "What is that random objective process? I don't know, but I can just tell you probabilities.",
    "start": 5931.36,
    "duration": 5.28
  },
  {
    "text": "And so really, whenever you see probabilities in a scientific theory, and they're all over the place,",
    "start": 5936.64,
    "duration": 4.16
  },
  {
    "text": "I read that as saying, here's where explanation stops and our theories halt. And if we want to",
    "start": 5941.6,
    "duration": 7.44
  },
  {
    "text": "go further, we're going to have to unpack that probability into some deeper theory.",
    "start": 5949.04,
    "duration": 5.44
  },
  {
    "text": "So if I say that it's free will in the case of the conscious agents,",
    "start": 5955.12,
    "duration": 7.76
  },
  {
    "text": "then, I mean, in some sense, that's just words. What the theory has is the probabilities,",
    "start": 5963.84,
    "duration": 9.28
  },
  {
    "text": "and it has no further explanation. So if I say, if I call that probability of free will,",
    "start": 5973.12,
    "duration": 5.2
  },
  {
    "text": "then I can call it that, but I haven't really done much to give much insight into the notion",
    "start": 5978.88,
    "duration": 6.16
  },
  {
    "text": "of free will. Free will then becomes a primitive, and maybe that's what I want to do. I want to say,",
    "start": 5985.04,
    "duration": 4.24
  },
  {
    "text": "this is where explanation stops, and so free will is primitive. So these probabilities are free will,",
    "start": 5989.84,
    "duration": 6.88
  },
  {
    "text": "and I agree that that's where my theory stops, that I can do no further.",
    "start": 5996.72,
    "duration": 6.48
  },
  {
    "text": "Now, what's interesting in the conscious agent dynamics that we're working on is that",
    "start": 6007.36,
    "duration": 4.4
  },
  {
    "text": "any group of conscious agents together also satisfy the definition of a conscious agent,",
    "start": 6011.92,
    "duration": 6.08
  },
  {
    "text": "and so they are a conscious agent. So any conscious agents interacting are also conscious",
    "start": 6018.0,
    "duration": 3.84
  },
  {
    "text": "agents. So in the theory, there's one conscious agent, because if you take all of them together,",
    "start": 6021.84,
    "duration": 5.28
  },
  {
    "text": "they would form one conscious agent. But then there are as many, if you're computational,",
    "start": 6027.12,
    "duration": 6.4
  },
  {
    "text": "there's only a countable number of them, or in my case, I don't know, it may be an uncountable",
    "start": 6033.52,
    "duration": 3.68
  },
  {
    "text": "number of conscious agents. But what's interesting is that you unpack this probability",
    "start": 6037.6,
    "duration": 6.4
  },
  {
    "text": "in the Markovian kernel, there could be one big probability for the one agent, but you can unpack",
    "start": 6044.0,
    "duration": 5.52
  },
  {
    "text": "that into all these dynamical systems that are interacting conscious agents with their own",
    "start": 6049.52,
    "duration": 4.0
  },
  {
    "text": "probabilities and their own kernels. And what's interesting is that you could then give,",
    "start": 6053.52,
    "duration": 5.44
  },
  {
    "text": "in some sense, an unpacking of the notion of free will in that way. You could say, well, yeah,",
    "start": 6058.96,
    "duration": 4.32
  },
  {
    "text": "the one agent has free will and this probability, but I can actually do some non-trivial unpacking",
    "start": 6063.36,
    "duration": 5.68
  },
  {
    "text": "of that notion in this sort of recursive unwinding of those probabilities throughout",
    "start": 6069.04,
    "duration": 5.36
  },
  {
    "text": "the network. So there is the possibility here of, I mean, ultimately, there will be a primitive",
    "start": 6074.4,
    "duration": 8.88
  },
  {
    "text": "notion of free will that is just primitive and not explained. But given that one, I can explain",
    "start": 6083.28,
    "duration": 5.2
  },
  {
    "text": "all these other free wills sort of interacting, arising from this most primitive notion of free",
    "start": 6088.72,
    "duration": 4.72
  },
  {
    "text": "will in a non-trivial way. But once again, I would point out something that I see all the time in",
    "start": 6093.44,
    "duration": 8.24
  },
  {
    "text": "scientific theories, no theory in science will ever explain everything. And I would love to see",
    "start": 6101.68,
    "duration": 6.16
  },
  {
    "text": "if Josje agrees or disagrees. I will just state to make a strong claim,",
    "start": 6107.84,
    "duration": 6.08
  },
  {
    "text": "there cannot be a theory of everything because every theory has to make assumptions and those",
    "start": 6114.0,
    "duration": 4.64
  },
  {
    "text": "assumptions are not explained, they're assumed. It's just that simple.",
    "start": 6118.64,
    "duration": 4.8
  },
  {
    "text": "Okay. Am I correct in my summary of your views on free will that if in a physical theory you",
    "start": 6126.48,
    "duration": 5.84
  },
  {
    "text": "have probability, now some of that probability is just due to our ignorance, but if there's a",
    "start": 6132.32,
    "duration": 4.32
  },
  {
    "text": "fundamental probability, you can get a lot of things done. And I think that's a really",
    "start": 6136.64,
    "duration": 5.12
  },
  {
    "text": "fundamental probability. You can just say, well, that's indicating that the theories break down,",
    "start": 6141.76,
    "duration": 5.28
  },
  {
    "text": "we just don't know. Or you can say that there's something underneath producing those and that,",
    "start": 6147.04,
    "duration": 4.4
  },
  {
    "text": "which is underneath the probabilities, is what you're calling free will. Is that correct or is",
    "start": 6151.44,
    "duration": 4.88
  },
  {
    "text": "that off? Right. So if I'm a physicalist, I'll say that that probability is due to some",
    "start": 6156.32,
    "duration": 6.0
  },
  {
    "text": "process that I can say no more about, but there's some process that generates this stuff. It's not",
    "start": 6163.84,
    "duration": 3.44
  },
  {
    "text": "free will, it's just a physical process that I don't know. But if I'm taking consciousness to be",
    "start": 6167.28,
    "duration": 5.12
  },
  {
    "text": "fundamental, then it's an interesting move to say that that probability can be interpreted as",
    "start": 6172.4,
    "duration": 6.72
  },
  {
    "text": "free will. Now, of course, I'm not explaining anything. I'm just putting the notion free will,",
    "start": 6180.08,
    "duration": 6.48
  },
  {
    "text": "the word free will on it, right? I see. And free will becomes just a primitive notion as well.",
    "start": 6186.56,
    "duration": 7.6
  },
  {
    "text": "So that's where my explanation stops. And the most unpacking I can do is that recursive",
    "start": 6194.16,
    "duration": 4.96
  },
  {
    "text": "unpacking that I mentioned, which is an interesting unpacking. But ultimately,",
    "start": 6199.12,
    "duration": 3.92
  },
  {
    "text": "there's this primitive notion of free will that I have nothing further to say about.",
    "start": 6203.04,
    "duration": 3.2
  },
  {
    "text": "But I think that that's not a problem specific to this theory. The last thing I was saying was that",
    "start": 6206.88,
    "duration": 7.44
  },
  {
    "text": "that's endemic to all scientific theories. Every scientific theory will have miracles",
    "start": 6214.32,
    "duration": 5.52
  },
  {
    "text": "at its foundation. By miracles, I mean assumptions that are taken for granted",
    "start": 6219.84,
    "duration": 5.12
  },
  {
    "text": "and not explained. If you explain them, then you'll have a deeper theory with new assumptions",
    "start": 6224.96,
    "duration": 4.96
  },
  {
    "text": "that explain those assumptions, but the new assumptions aren't explained. And so in this sense,",
    "start": 6229.92,
    "duration": 5.52
  },
  {
    "text": "science can never have a theory of everything because science theories always have assumptions,",
    "start": 6235.44,
    "duration": 5.68
  },
  {
    "text": "and the assumptions are what you don't explain.",
    "start": 6241.12,
    "duration": 1.84
  },
  {
    "text": "Yeah. Joscha, I know Donald said there are quite a few elements to pick from there.",
    "start": 6243.12,
    "duration": 6.16
  },
  {
    "text": "So we are interlocking claims, but let's address them. First of all, I don't know whether there",
    "start": 6250.56,
    "duration": 7.04
  },
  {
    "text": "can be one theory of everything because my reasoning is not tight enough to make that",
    "start": 6257.6,
    "duration": 5.84
  },
  {
    "text": "proof one way or the other. So at this point, I have to remain agnostic because I think from",
    "start": 6263.44,
    "duration": 5.76
  },
  {
    "text": "where I stand, it seems to be possible that there can be a theory of everything, and it seems to be",
    "start": 6269.2,
    "duration": 4.56
  },
  {
    "text": "possible that there cannot. From a computationalist perspective, whenever you have a set of",
    "start": 6273.76,
    "duration": 7.44
  },
  {
    "text": "observations that is finite, you will be able to construct a computational model that explains",
    "start": 6281.2,
    "duration": 6.0
  },
  {
    "text": "how to make such patterns. So in principle, there can always be a theory of everything that you",
    "start": 6287.2,
    "duration": 6.0
  },
  {
    "text": "observe. That's something that I don't see a way around this. So this seems to be sound to me,",
    "start": 6293.2,
    "duration": 7.36
  },
  {
    "text": "and I think that can be formally proven, but it seems to be almost trivial that it's proven. So",
    "start": 6300.56,
    "duration": 6.24
  },
  {
    "text": "it's more interesting. The question is, can you narrow this down to a single one, to one theory",
    "start": 6306.8,
    "duration": 4.88
  },
  {
    "text": "of everything? You will be always stuck with infinitely many theories of everything, where",
    "start": 6311.68,
    "duration": 5.44
  },
  {
    "text": "most of these theories will be super inelegant and redundant and basically recordings of your",
    "start": 6317.12,
    "duration": 4.72
  },
  {
    "text": "observations. Or will there be one theory that is the most elegant and explains everything neatly",
    "start": 6321.84,
    "duration": 6.64
  },
  {
    "text": "and wraps it up? And of course, if you think about the space of all theories and think of them as",
    "start": 6328.48,
    "duration": 6.08
  },
  {
    "text": "things that you can do in a language in which you can define truth, and if you realize that the",
    "start": 6334.56,
    "duration": 6.72
  },
  {
    "text": "languages in which you can define truth consistently are the computational languages, it turns out that",
    "start": 6341.28,
    "duration": 5.12
  },
  {
    "text": "all your models are going to be automata, and that you can sort the space of automata by the length",
    "start": 6346.4,
    "duration": 4.72
  },
  {
    "text": "of their definitions. So it also seems that in principle it should be possible to find the",
    "start": 6351.12,
    "duration": 5.2
  },
  {
    "text": "shortest automaton between two every pair of automata that you can construct and can up this.",
    "start": 6356.32,
    "duration": 5.36
  },
  {
    "text": "Now the question is, what's your search procedure for all the possible automata? Do you have a search",
    "start": 6361.68,
    "duration": 4.96
  },
  {
    "text": "procedure that you can hope that terminates? And this is not a question of whether it's mathematically",
    "start": 6366.64,
    "duration": 7.76
  },
  {
    "text": "possible, but whether it's efficient. So is there an efficient strategy to find a theory of",
    "start": 6374.4,
    "duration": 6.0
  },
  {
    "text": "everything that is the shortest one? And so far we haven't found one. And it relates to what AI is",
    "start": 6380.4,
    "duration": 8.0
  },
  {
    "text": "doing in machine learning when it tries to identify what's going on in the domain. So in principle,",
    "start": 6388.4,
    "duration": 6.64
  },
  {
    "text": "we can always be sure that we could be a brain in a vat and everything is just a nefarious conspiracy",
    "start": 6395.04,
    "duration": 5.2
  },
  {
    "text": "that is playing out. And because we cannot exclude this, we can never be sure that our",
    "start": 6400.88,
    "duration": 4.24
  },
  {
    "text": "theory of everything is the best theory that could exist of things. So that's obviously the",
    "start": 6405.12,
    "duration": 7.12
  },
  {
    "text": "case. But if we take out this single thing and make the assumption that reality is not a conspiracy,",
    "start": 6412.24,
    "duration": 6.48
  },
  {
    "text": "I think then it starts to look a lot brighter. Let's get to the notion of free will.",
    "start": 6420.24,
    "duration": 5.6
  },
  {
    "text": "I think that free will is tied into the notion of agency. And the best explanation of what an agent",
    "start": 6426.8,
    "duration": 7.52
  },
  {
    "text": "is that I found so far is that an agent is a control system that is intrinsically combined",
    "start": 6434.32,
    "duration": 6.56
  },
  {
    "text": "with its own set point generator. A control system is a notion from cybernetics. It means you have",
    "start": 6440.88,
    "duration": 6.32
  },
  {
    "text": "some system like a thermostat that is making a measurement using sensors, for instance,",
    "start": 6447.2,
    "duration": 5.04
  },
  {
    "text": "the temperature in the room, and that has effectors by which it can change the dynamics of the system.",
    "start": 6452.24,
    "duration": 5.2
  },
  {
    "text": "So the effector would be a switch that turns the heating on and off. And the system that's being",
    "start": 6457.44,
    "duration": 3.68
  },
  {
    "text": "regulated is the temperature in the room. And the temperature in the room is disturbed",
    "start": 6461.12,
    "duration": 4.96
  },
  {
    "text": "by the environment. And a simple thermostat will only act on its present measurement and then",
    "start": 6466.08,
    "duration": 6.48
  },
  {
    "text": "translate this present measurement using a single parameter into whether it should switch or not.",
    "start": 6473.28,
    "duration": 4.24
  },
  {
    "text": "And depending on choosing that parameter well, you have a more efficient regulation or not.",
    "start": 6477.52,
    "duration": 6.8
  },
  {
    "text": "But if you want to be more efficient, you need to model the environment and the dynamics of",
    "start": 6484.96,
    "duration": 4.32
  },
  {
    "text": "the system and maybe the dynamics of the sensory system and the actuator itself.",
    "start": 6489.28,
    "duration": 4.72
  },
  {
    "text": "And you can do this. It means that you model the future of the regulation based on past",
    "start": 6494.88,
    "duration": 5.52
  },
  {
    "text": "observations. So if you endow the controller with the ability to make a model of the future",
    "start": 6500.4,
    "duration": 4.96
  },
  {
    "text": "and use this control model to fine tune the actions of the controller, it means that a",
    "start": 6505.36,
    "duration": 5.36
  },
  {
    "text": "controller now is more than a thermostat. It's not going to just optimize the temperature in the room",
    "start": 6510.72,
    "duration": 4.4
  },
  {
    "text": "the next frame. But it's going to optimize the integral of the temperature over a long time",
    "start": 6515.12,
    "duration": 5.04
  },
  {
    "text": "span. So it basically takes a long expectation horizon. The further it goes, the better probably.",
    "start": 6520.16,
    "duration": 6.0
  },
  {
    "text": "And then it tries to minimize all the temperature deviations from the ideal temperature from the",
    "start": 6526.16,
    "duration": 4.8
  },
  {
    "text": "set point over that time span. This means that depending on the fidelity and detail of the model",
    "start": 6530.96,
    "duration": 5.84
  },
  {
    "text": "of its environment and its interaction with the environment and itself, it's going to be better",
    "start": 6536.8,
    "duration": 5.52
  },
  {
    "text": "and better if it assumes that there are trajectories in the world that are the result of",
    "start": 6542.32,
    "duration": 4.96
  },
  {
    "text": "its own decisions. By turning the temperature on and off at this particular point in time,",
    "start": 6547.28,
    "duration": 5.76
  },
  {
    "text": "I'm going to get this and this result, depending on the weather outside, depending on how often",
    "start": 6553.04,
    "duration": 4.64
  },
  {
    "text": "people open and close the door to the room at different times of the day, depending on the",
    "start": 6557.68,
    "duration": 5.2
  },
  {
    "text": "aging of my sensor or the distance of my sensor to the heating, and depending on whether the",
    "start": 6562.88,
    "duration": 6.32
  },
  {
    "text": "window on top of the sensor is currently open or closed and so on. I get lots and lots more ways to",
    "start": 6569.76,
    "duration": 6.0
  },
  {
    "text": "differentiate the event flow in the universe and the path that the universe can take and the",
    "start": 6575.76,
    "duration": 4.88
  },
  {
    "text": "interactions that I can have with the universe that determine whether somebody will open the",
    "start": 6580.64,
    "duration": 4.48
  },
  {
    "text": "window and so on and so on. So you have all these points where the controller is a very differentiated",
    "start": 6585.12,
    "duration": 8.16
  },
  {
    "text": "model of reality, where it's going to prefer some events of others and is going to assign",
    "start": 6593.28,
    "duration": 5.92
  },
  {
    "text": "its own decisions to these trajectories. And this decision making necessarily happens under",
    "start": 6599.2,
    "duration": 5.84
  },
  {
    "text": "conditions of uncertainty, which means the controller will never be completely sure which",
    "start": 6605.04,
    "duration": 6.48
  },
  {
    "text": "one is going to the right decision. The controller will have to make educated guesses, bets on the",
    "start": 6611.52,
    "duration": 4.72
  },
  {
    "text": "future. And this even includes the models of itself, right? The better the control system",
    "start": 6616.24,
    "duration": 5.44
  },
  {
    "text": "understands itself and the limitations of its modeling ability, the better its models are going",
    "start": 6621.68,
    "duration": 4.72
  },
  {
    "text": "to be. So at some point of complexity, this thing is going to understand its own modeling procedure",
    "start": 6626.4,
    "duration": 5.36
  },
  {
    "text": "to improve it and to find gaps in it and so on. And this also means that when it starts to do this,",
    "start": 6631.76,
    "duration": 7.12
  },
  {
    "text": "it is going to discover that there are agents in the world, other controllers that have set",
    "start": 6638.88,
    "duration": 3.84
  },
  {
    "text": "points, generators and model the future and make decisions. For instance, people that might open",
    "start": 6642.72,
    "duration": 4.32
  },
  {
    "text": "the window when you make the room too hot and you lose energy because of that. So maybe not",
    "start": 6647.04,
    "duration": 4.64
  },
  {
    "text": "overheat the room and people are in the room. This means you have to model agency at some point.",
    "start": 6651.68,
    "duration": 5.68
  },
  {
    "text": "And you will also discover yourself as an agent in the world, as a controller, as a set point generator",
    "start": 6657.36,
    "duration": 4.4
  },
  {
    "text": "and the ability to model the future. And you will discover this before you understand how your own",
    "start": 6661.76,
    "duration": 5.04
  },
  {
    "text": "modeling of the future works. So you also have to make bets on how you work before you understand",
    "start": 6666.8,
    "duration": 6.8
  },
  {
    "text": "yourself. So you will discover a self-model. The self-model is the agent where the contents of",
    "start": 6673.6,
    "duration": 6.32
  },
  {
    "text": "your own model are driving the behavior of that agent. It's a very particular agent. It's one",
    "start": 6679.92,
    "duration": 5.28
  },
  {
    "text": "where your reasoning and your modeling has an influence on what this agent is going to do,",
    "start": 6685.2,
    "duration": 4.88
  },
  {
    "text": "a direct coupling. It's a very specific model, a very specific agent that you discover there.",
    "start": 6690.08,
    "duration": 5.68
  },
  {
    "text": "And so in some sense, free will, I think, is a perspective on decision making under uncertainty",
    "start": 6695.76,
    "duration": 5.12
  },
  {
    "text": "starting from the point where you discover your own self-model up to the point where you",
    "start": 6701.84,
    "duration": 4.48
  },
  {
    "text": "deconstruct it again. And of course you will deconstruct it again at some point. You will be",
    "start": 6706.32,
    "duration": 4.96
  },
  {
    "text": "able to fully understand how you're operating. And once you do this, making your decision becomes",
    "start": 6711.28,
    "duration": 5.68
  },
  {
    "text": "indistinguishable from predicting your decision. Because of computational irreducibility, often you",
    "start": 6716.96,
    "duration": 5.44
  },
  {
    "text": "will not be able to predict the position before you make it, right? But as soon as you understand",
    "start": 6722.4,
    "duration": 6.24
  },
  {
    "text": "that there is just a computational process going on, and you understand the properties of that",
    "start": 6728.64,
    "duration": 4.88
  },
  {
    "text": "process, you will no longer experience yourself as having free will. Free will is a particular",
    "start": 6733.52,
    "duration": 5.68
  },
  {
    "text": "kind of model that happens as a result of your own self-model being a simulacrum, instead of being a",
    "start": 6739.2,
    "duration": 6.24
  },
  {
    "text": "high-fidelity simulation of how you actually work. And we are young beings. We don't get very old.",
    "start": 6745.44,
    "duration": 7.6
  },
  {
    "text": "It's very difficult for us to get to the point where we fully understand how we work,",
    "start": 6753.04,
    "duration": 3.52
  },
  {
    "text": "except in certain circumstances, right? When we observe our children, very often we get to the",
    "start": 6757.28,
    "duration": 4.4
  },
  {
    "text": "point as parents that we fully understand what they will be doing in a given situation.",
    "start": 6761.68,
    "duration": 3.92
  },
  {
    "text": "And we can fully understand their own actions and anticipate their decisions. And the child",
    "start": 6765.6,
    "duration": 3.76
  },
  {
    "text": "might experience that it has free will. And we experience that the child has free will up to the",
    "start": 6769.36,
    "duration": 4.08
  },
  {
    "text": "point where we suddenly understand, oh, this is what's going on. And at this point, I can completely",
    "start": 6773.44,
    "duration": 5.2
  },
  {
    "text": "control the child because I can out-model it, right? And it's only to the point where this",
    "start": 6778.64,
    "duration": 5.92
  },
  {
    "text": "system is going to introduce levels that are, again, reaching my own level, that decisions",
    "start": 6784.56,
    "duration": 5.76
  },
  {
    "text": "become unpredictable. But if I am a few levels of modeling depth above the other agent that might",
    "start": 6790.32,
    "duration": 5.84
  },
  {
    "text": "think that it's free will, the free will starts to disappear from my own perspective. And also",
    "start": 6796.16,
    "duration": 4.24
  },
  {
    "text": "happens in my own mind. There's many things that I do, but I thought as a child, I'm acting out of",
    "start": 6800.4,
    "duration": 5.12
  },
  {
    "text": "my own free will. And now I understand how mechanical it is. And I can deal with myself",
    "start": 6805.52,
    "duration": 4.8
  },
  {
    "text": "by controlling myself, by out-modeling myself successively, and becoming one more complex in",
    "start": 6811.28,
    "duration": 4.56
  },
  {
    "text": "this way. And in all that, Josje, the computational process, the probabilities",
    "start": 6815.84,
    "duration": 8.24
  },
  {
    "text": "in the transition rules, you would view those as objective probabilities then?",
    "start": 6824.08,
    "duration": 3.6
  },
  {
    "text": "Yes. So there is also this issue that I don't actually exist in the way in which I model",
    "start": 6829.92,
    "duration": 4.32
  },
  {
    "text": "myself. I only exist to some degree of approximation. I'm not this big tree that",
    "start": 6834.24,
    "duration": 4.88
  },
  {
    "text": "is strictly implemented in physical reality. I'm more like a bunch of shrubbery. And some of the",
    "start": 6839.12,
    "duration": 6.32
  },
  {
    "text": "shrubbery is tasked with making a model of myself as a tree. And that model is going to be coarse",
    "start": 6845.44,
    "duration": 6.0
  },
  {
    "text": "approximation. So the fact that I am unable to follow up on my plans means that I'm only",
    "start": 6851.44,
    "duration": 5.6
  },
  {
    "text": "approximately implemented. The rubber hand illusion is a good example of how we're continually",
    "start": 6857.04,
    "duration": 5.36
  },
  {
    "text": "redefining who we are, right? Where you tap and drag on a hand at the same time you're",
    "start": 6862.4,
    "duration": 5.44
  },
  {
    "text": "tapping and dragging on a rubber hand. And if you do it just right with a person,",
    "start": 6868.8,
    "duration": 3.92
  },
  {
    "text": "they'll take this rubber hand and incorporate it into their body image. So we're always learning",
    "start": 6872.72,
    "duration": 3.36
  },
  {
    "text": "who we are. But those probabilities in that learning process, you would take as objective",
    "start": 6876.08,
    "duration": 4.64
  },
  {
    "text": "probabilities and not free will kinds of probabilities. What does it mean that a",
    "start": 6880.72,
    "duration": 5.68
  },
  {
    "text": "probability is objective? It only means based on the models in which I have currently made.",
    "start": 6886.4,
    "duration": 5.2
  },
  {
    "text": "And if I go far beyond back, I cannot assign an objective probability to the probabilities that I",
    "start": 6891.6,
    "duration": 7.84
  },
  {
    "text": "am observing because they are contingent on the assumption, for instance, I'm currently not in a",
    "start": 6899.44,
    "duration": 4.32
  },
  {
    "text": "dream. Or that my memories are correct or that my data are correct or that the theories that",
    "start": 6903.76,
    "duration": 6.0
  },
  {
    "text": "event into establishing the relationships between my measurements and my data and so on are correct.",
    "start": 6909.76,
    "duration": 5.12
  },
  {
    "text": "So I do agree that at some point there are a lot of assumptions that go into this. And these",
    "start": 6914.88,
    "duration": 5.12
  },
  {
    "text": "assumptions differ with you are usually mild because I make so many observations that at some",
    "start": 6920.0,
    "duration": 6.4
  },
  {
    "text": "point I can, the arrows cancel each other out. Or there's so many people that can verify my ideas",
    "start": 6926.4,
    "duration": 6.08
  },
  {
    "text": "and shut them down. And so my ideas don't exist in isolation. They are being shot against every",
    "start": 6932.48,
    "duration": 5.6
  },
  {
    "text": "philosophy and physics book that I can get my hands on and that I understand, right? And every",
    "start": 6938.08,
    "duration": 4.32
  },
  {
    "text": "conversation that I have. So that doesn't mean that I will discover the truth in this way, but",
    "start": 6942.4,
    "duration": 6.88
  },
  {
    "text": "it means that I discover many, many of the possible errors that I can make. And at some point I realized",
    "start": 6949.28,
    "duration": 4.8
  },
  {
    "text": "that there is a finite space of theories that exists and that we are discovering the same things",
    "start": 6954.08,
    "duration": 6.72
  },
  {
    "text": "again and again. So when we ask ourselves, what are integers, for instance, or what are rational",
    "start": 6960.8,
    "duration": 5.2
  },
  {
    "text": "numbers, there are many ways of making theories about what integers are. For instance, we can say",
    "start": 6966.0,
    "duration": 5.6
  },
  {
    "text": "that there are the cardinalities of sets. So basically you count members of a set, and this",
    "start": 6971.6,
    "duration": 5.28
  },
  {
    "text": "is an integer, and all the numbers of members of sets that you can have are integers. Or you can say",
    "start": 6976.88,
    "duration": 5.68
  },
  {
    "text": "that there are a subsequent Liebling scheme. That's the definition that I currently prefer.",
    "start": 6982.56,
    "duration": 3.84
  },
  {
    "text": "Or you can use Peano's axioms to formalize them. And it turns out that they all describe exactly",
    "start": 6987.84,
    "duration": 6.0
  },
  {
    "text": "the same thing. They are all different perspectives on the same thing. And once you understand the",
    "start": 6993.84,
    "duration": 6.0
  },
  {
    "text": "larger space that runs the integers, you also understand why they are different perspectives,",
    "start": 6999.84,
    "duration": 4.16
  },
  {
    "text": "because you understand how these perspectives are being constructed, and you can show that it's all",
    "start": 7004.0,
    "duration": 4.8
  },
  {
    "text": "the same thing. So in some sense, the integers are a fractal. And you can describe this fractal",
    "start": 7008.8,
    "duration": 5.52
  },
  {
    "text": "using a generator function, and you can also describe it in many other ways. And it seems that",
    "start": 7014.32,
    "duration": 5.36
  },
  {
    "text": "mathematics, or all the languages that we can use that work, are usually a small, relatively",
    "start": 7019.68,
    "duration": 5.84
  },
  {
    "text": "intelligible set of fractals. And they are the boundary of what is intelligible to the human",
    "start": 7026.96,
    "duration": 5.36
  },
  {
    "text": "mind, but not that far above it, and probably still inside of it. So I'm more optimistic than you are.",
    "start": 7032.32,
    "duration": 7.52
  },
  {
    "text": "I have a question for the both of you. It's about your models. How much of it would have to change,",
    "start": 7041.36,
    "duration": 5.04
  },
  {
    "text": "let's say, Joscha, in your case, if classical logic was indeed correct, if continuities exist?",
    "start": 7046.4,
    "duration": 5.76
  },
  {
    "text": "And for Donald, if the opposite was true, so continuity doesn't exist, intuitionist logic is",
    "start": 7052.16,
    "duration": 5.6
  },
  {
    "text": "primary. So at some point in my life, I thought that continuity must exist, because everybody was",
    "start": 7058.32,
    "duration": 9.76
  },
  {
    "text": "assuming that it did. Like, most of the eminent physicists thought that the universe must be",
    "start": 7068.08,
    "duration": 5.12
  },
  {
    "text": "fundamentally continuous. Many of the foundational theories that we have in physics",
    "start": 7073.2,
    "duration": 4.24
  },
  {
    "text": "assume that there is continuity. And I thought that my inability to derive continuity, to construct",
    "start": 7077.44,
    "duration": 6.32
  },
  {
    "text": "a continuous system, is the result of my lack of understanding. And it took me quite some time to",
    "start": 7083.76,
    "duration": 6.88
  },
  {
    "text": "realize that what Gödel has stumbled upon was actually the insight that continuity cannot exist,",
    "start": 7090.64,
    "duration": 7.04
  },
  {
    "text": "because it's not constructive, cannot be implemented. So once you have the infinities,",
    "start": 7097.68,
    "duration": 5.12
  },
  {
    "text": "once you presuppose them, there are an amazing cornucopia, all sorts of stuff falls out.",
    "start": 7103.44,
    "duration": 5.2
  },
  {
    "text": "Like, you have Hilbert's Hotel that is completely booked out, but has infinitely many rooms, and then",
    "start": 7109.28,
    "duration": 4.88
  },
  {
    "text": "there are infinitely many buses coming on, and you just ask everybody to move in the room with",
    "start": 7114.16,
    "duration": 4.48
  },
  {
    "text": "twice their number, and then you fit in the infinitely many new people, right? This is not a feature.",
    "start": 7118.64,
    "duration": 6.8
  },
  {
    "text": "This is a bug. This shouldn't happen. And no hotels work. No hotels work like this.",
    "start": 7126.24,
    "duration": 5.76
  },
  {
    "text": "This is not good if something like this happens. And it's not surprising that this blows up when",
    "start": 7132.64,
    "duration": 5.76
  },
  {
    "text": "you try to make proofs. And so I think that Hilbert's Hotel points not to a miracle in the",
    "start": 7138.4,
    "duration": 7.44
  },
  {
    "text": "universe that under certain circumstances you get something for nothing, which is very nice if you",
    "start": 7145.84,
    "duration": 4.24
  },
  {
    "text": "want to derive a universe from nothing. But it shows that your language can break. And so I don't",
    "start": 7150.08,
    "duration": 7.52
  },
  {
    "text": "see a way to get the languages in which continuity exists to work. And I cannot exclude that I'm wrong,",
    "start": 7157.6,
    "duration": 7.44
  },
  {
    "text": "and I might see a way in the future, or somebody else does, in a way that I don't. I just don't see",
    "start": 7165.04,
    "duration": 5.36
  },
  {
    "text": "a way how to make continuity work. But I get all the benefits from continuity for the description",
    "start": 7170.4,
    "duration": 5.44
  },
  {
    "text": "of practical systems using discrete logic. So in this sense, I would say that dynamical systems",
    "start": 7175.84,
    "duration": 6.24
  },
  {
    "text": "that are truly continuous don't exist. They're not causally existing. They cannot be causal.",
    "start": 7182.08,
    "duration": 5.68
  },
  {
    "text": "They are a layer of description that I use to deal with too many parts to count, and they are",
    "start": 7187.76,
    "duration": 5.44
  },
  {
    "text": "sometimes a very useful abstraction. But they cannot be used for a foundational theory.",
    "start": 7193.2,
    "duration": 4.4
  },
  {
    "text": "Because the foundational stuff has to work. It has to be described in a language where all the",
    "start": 7198.88,
    "duration": 4.64
  },
  {
    "text": "parts have to interface in such a way that your language doesn't blow up, because otherwise",
    "start": 7204.48,
    "duration": 4.4
  },
  {
    "text": "the terms in your language don't mean anything. So what this means is that the word",
    "start": 7208.88,
    "duration": 4.56
  },
  {
    "text": "continuity does not actually mean anything in my world. It does not have a useful reference.",
    "start": 7213.44,
    "duration": 5.84
  },
  {
    "text": "I cannot point at anything that is truly continuous without my language breaking.",
    "start": 7219.84,
    "duration": 4.4
  },
  {
    "text": "So it doesn't exist. It's a word that only exists as a confusion. But it exists approximately.",
    "start": 7225.44,
    "duration": 5.6
  },
  {
    "text": "It exists as the dynamics of too many parts to count, which is fine.",
    "start": 7231.04,
    "duration": 3.12
  },
  {
    "text": "So I'm a confused man. And when you say that the language is breaking, I just see it as",
    "start": 7235.52,
    "duration": 4.72
  },
  {
    "text": "you saying that there are extremely unintuitive results that, well, they don't seem to make sense,",
    "start": 7240.24,
    "duration": 5.04
  },
  {
    "text": "but it doesn't mean that they don't make sense, because you defined work as what's implementable.",
    "start": 7245.28,
    "duration": 5.36
  },
  {
    "text": "Now, what it doesn't work means that you can no longer derive truth. It means, for instance,",
    "start": 7250.64,
    "duration": 4.64
  },
  {
    "text": "in an axiomatic system, if you have a contradiction in your axioms, it means that you can suddenly",
    "start": 7255.28,
    "duration": 4.88
  },
  {
    "text": "derive everything and nothing. It just means that your fractal is no longer having a discernible",
    "start": 7260.16,
    "duration": 7.12
  },
  {
    "text": "structure. This is what it means that it's breaking. What is the exact contradiction",
    "start": 7267.28,
    "duration": 6.32
  },
  {
    "text": "in classical logic? Because it seems as though mathematicians are getting along fine,",
    "start": 7273.6,
    "duration": 5.12
  },
  {
    "text": "and it's difficult, extremely difficult, to prove certain theorems. And it wouldn't be if there was",
    "start": 7278.72,
    "duration": 4.0
  },
  {
    "text": "a contradiction. Well, not necessarily, but you understand what I mean. Yes. So the issue is that",
    "start": 7282.72,
    "duration": 5.68
  },
  {
    "text": "the assumption of a stateless platonic notion of truth that holds independent of the process",
    "start": 7288.4,
    "duration": 5.6
  },
  {
    "text": "by which you discover the truth leads into contradictions. And this was what Gödel had",
    "start": 7294.0,
    "duration": 5.84
  },
  {
    "text": "proven. It basically means that a sentence that is true under these assumptions is also false under",
    "start": 7299.84,
    "duration": 5.28
  },
  {
    "text": "these assumptions. So it cannot be true. And this is where undecidability comes in. It's not just",
    "start": 7305.12,
    "duration": 5.84
  },
  {
    "text": "about that some sentences are not reachable, because you don't know whether they're true or",
    "start": 7310.96,
    "duration": 3.92
  },
  {
    "text": "false. It also means that there are some sentences that are true and false at the same time. But if",
    "start": 7314.88,
    "duration": 6.0
  },
  {
    "text": "you have to find truth in such a way that it can, that it includes falsity, something is either true",
    "start": 7320.88,
    "duration": 6.48
  },
  {
    "text": "or false. If you have an excluded middle, then this cannot be the case. So this is a very bad",
    "start": 7327.36,
    "duration": 5.52
  },
  {
    "text": "result. It just means that your language is not working. It gets to illegal states. It just means",
    "start": 7332.88,
    "duration": 5.28
  },
  {
    "text": "that the application of steps that you have prescribed in your logic, if you apply them",
    "start": 7338.16,
    "duration": 5.44
  },
  {
    "text": "properly, leads to an undefined result. It means that your language is segfaulting. It means your",
    "start": 7343.6,
    "duration": 6.64
  },
  {
    "text": "mind is breaking apart. It means that the thoughts that you are thinking no longer have meaning,",
    "start": 7350.24,
    "duration": 4.64
  },
  {
    "text": "because they can no longer point to anything that could be implemented.",
    "start": 7354.88,
    "duration": 3.36
  },
  {
    "text": "Okay, so Don, the question that I asked before was, let's imagine the intuitionist logic is",
    "start": 7361.52,
    "duration": 5.52
  },
  {
    "text": "correct. How does your theory change? Well, yeah, so I mean, I could easily",
    "start": 7367.04,
    "duration": 8.4
  },
  {
    "text": "implement the theory of conscious agents, you know, in an intuitionist logic kind of approach",
    "start": 7377.68,
    "duration": 4.96
  },
  {
    "text": "and run it that way. So that wouldn't really change my theory of conscious agents fundamentally. But",
    "start": 7382.72,
    "duration": 6.48
  },
  {
    "text": "my own thinking on this, I guess, does differ from Joscha's in an interesting way here. And that is,",
    "start": 7391.84,
    "duration": 6.96
  },
  {
    "text": "I do take Gödel's result, not necessarily to show that the notion of continuity is nonsense or",
    "start": 7399.36,
    "duration": 9.76
  },
  {
    "text": "contradictory, but rather that if I have a finite system of axioms and derivation rules,",
    "start": 7409.12,
    "duration": 7.52
  },
  {
    "text": "then you can look at the set of statements that can be proven by that system, then you can find",
    "start": 7418.0,
    "duration": 8.08
  },
  {
    "text": "statements that are not provable within that system, so they're undecidable from within that",
    "start": 7426.08,
    "duration": 5.76
  },
  {
    "text": "system. But what Gödel did was to put a mapping onto the language of that system, so he could",
    "start": 7431.84,
    "duration": 8.88
  },
  {
    "text": "write down an analogy, as Douglas Hofstadter likes to talk about it. He found an analogy that he",
    "start": 7440.72,
    "duration": 6.72
  },
  {
    "text": "could write down, where there is this sentence I could write down that says, I am true,",
    "start": 7447.44,
    "duration": 6.08
  },
  {
    "text": "but not provable within this system. And that doesn't seem to me to require me going all the",
    "start": 7454.0,
    "duration": 7.2
  },
  {
    "text": "way off to uncountable infinities and continuity and so forth. It's just saying, I mean,",
    "start": 7461.2,
    "duration": 5.2
  },
  {
    "text": "here's the deflationary reading of Gödel. It's just saying, you give me any computational system,",
    "start": 7466.4,
    "duration": 5.04
  },
  {
    "text": "I'll find a statement that's true, but can't be derived from within that system. Therefore,",
    "start": 7472.0,
    "duration": 4.8
  },
  {
    "text": "any computation that you pick isn't the final word. I don't have to go all the way to",
    "start": 7476.8,
    "duration": 5.76
  },
  {
    "text": "you know, uncountable sets and so forth. I can just use that to say that the computation can't",
    "start": 7483.92,
    "duration": 8.4
  },
  {
    "text": "be the final truth. And so that would be sort of the minimal way. And that's why I think a lot of",
    "start": 7492.32,
    "duration": 7.2
  },
  {
    "text": "researchers have interpreted Gödel, but I guess you all should disagree on that.",
    "start": 7502.4,
    "duration": 4.32
  },
  {
    "text": "Okay, what would be the thing that goes beyond that? So what is the other language that you can",
    "start": 7508.08,
    "duration": 4.96
  },
  {
    "text": "use after Gödel's language broke? Well, what you do is you take the new statement",
    "start": 7513.04,
    "duration": 6.4
  },
  {
    "text": "that you showed was undecidable within that computation system, and you add it to your",
    "start": 7520.8,
    "duration": 5.92
  },
  {
    "text": "computational system, right? Every computational system has axioms. You don't compute without",
    "start": 7526.72,
    "duration": 4.72
  },
  {
    "text": "some assumptions. So your computation has to have certain axioms to begin with. So you add it to",
    "start": 7531.44,
    "duration": 4.48
  },
  {
    "text": "your axiom. It's now still a finite set of axioms. And now you say, okay, now I'm good. I took that",
    "start": 7535.92,
    "duration": 5.36
  },
  {
    "text": "undecidable sentence and I put it into my set of axioms. I'm good. Now I'm done. Well, no, you're",
    "start": 7541.28,
    "duration": 4.32
  },
  {
    "text": "not. Now, because Gödel comes back and says, you know what, I just found another statement within",
    "start": 7545.6,
    "duration": 4.08
  },
  {
    "text": "your new system, and that's not computable. So I'm not getting anywhere near to these uncountable",
    "start": 7549.68,
    "duration": 4.8
  },
  {
    "text": "infinities. No, wait, wait, wait. You're making a step too far here, I think. You have just found",
    "start": 7554.48,
    "duration": 4.96
  },
  {
    "text": "this procedure that discovers that something is true that is not true according to mathematics.",
    "start": 7559.44,
    "duration": 5.36
  },
  {
    "text": "So Gödel is trying to find a foundation for all of mathematics. And he does this by reducing the",
    "start": 7565.52,
    "duration": 6.72
  },
  {
    "text": "mathematics that he's interested in to Peano arithmetic, and then computes all of mathematics",
    "start": 7572.24,
    "duration": 5.36
  },
  {
    "text": "in Peano arithmetic and discovers that he cannot recover the semantics that he wanted to discover,",
    "start": 7577.6,
    "duration": 5.68
  },
  {
    "text": "which was a platonic notion of truth, one that is independent of the state sequence that he",
    "start": 7583.28,
    "duration": 4.16
  },
  {
    "text": "runs it through. This is the thing that he cannot recover. And you try to recover the original",
    "start": 7587.44,
    "duration": 4.56
  },
  {
    "text": "mathematics by extending the axiomatic system, Peano's axioms, with an infinite set of arbitrary",
    "start": 7592.0,
    "duration": 8.0
  },
  {
    "text": "statements. This doesn't seem to be very elegant. Also, of course, Gödel shows that it doesn't",
    "start": 7600.0,
    "duration": 4.72
  },
  {
    "text": "terminate. It doesn't work. It's not fixing mathematics in any way. So you still have",
    "start": 7604.72,
    "duration": 5.6
  },
  {
    "text": "the intuition here that you have a procedure that allows you to discover truth in ways that",
    "start": 7611.12,
    "duration": 5.12
  },
  {
    "text": "Gödel's procedure could not. And if you have that procedure, you should be able to prove that it's",
    "start": 7616.24,
    "duration": 6.0
  },
  {
    "text": "true. If you cannot prove that it's true, I'm not going to believe you. I don't think that the",
    "start": 7622.24,
    "duration": 6.8
  },
  {
    "text": "statements that you think are true but my system cannot prove are true. Unless you can compute them.",
    "start": 7629.04,
    "duration": 7.84
  },
  {
    "text": "So you have to show a way that would force me as a rational observer and colleague of yours",
    "start": 7636.88,
    "duration": 6.08
  },
  {
    "text": "that is completely charitable and so on and reasonable and rational to follow you there.",
    "start": 7642.96,
    "duration": 6.32
  },
  {
    "text": "So if you can give me a rational procedure, then I expect that this procedure will be",
    "start": 7649.28,
    "duration": 6.0
  },
  {
    "text": "computational. That there will be a sequence of steps that I can follow to see why your claim",
    "start": 7655.28,
    "duration": 7.44
  },
  {
    "text": "that the sentence is true is actually valid. If you cannot make such a claim, I don't see how I can",
    "start": 7662.72,
    "duration": 6.16
  },
  {
    "text": "believe you. Well, so the way I understand Gödel doing it is that he comes up with this whole",
    "start": 7668.88,
    "duration": 6.48
  },
  {
    "text": "Gödel numbering approach. And he takes you through and shows you this mapping from the numbers into",
    "start": 7675.36,
    "duration": 9.6
  },
  {
    "text": "these Gödel numbers that are making statements about the numbers themselves. And you look at",
    "start": 7684.96,
    "duration": 4.56
  },
  {
    "text": "that and you go, yeah, okay. I understand that mapping. That's perfectly fine. And now I can",
    "start": 7689.52,
    "duration": 5.6
  },
  {
    "text": "write down within that mapping, I can write down this number. And when I look at the interpretation",
    "start": 7695.12,
    "duration": 5.52
  },
  {
    "text": "of that number under this mapping, the number says I am true but not provable within Keanu.",
    "start": 7700.64,
    "duration": 7.44
  },
  {
    "text": "And so now, at this point, I sort of agree with Roger Penrose. Penrose looks at that and says,",
    "start": 7709.44,
    "duration": 7.36
  },
  {
    "text": "okay, that means that there is something true here. I can see that it's true. I don't disbelieve",
    "start": 7716.8,
    "duration": 7.68
  },
  {
    "text": "I saw the whole Gödel numbering construction. I saw how the sentence came to say what it says.",
    "start": 7725.52,
    "duration": 5.68
  },
  {
    "text": "And I agree that it's all consistent. And what it's saying, it's saying that it's true and not",
    "start": 7731.2,
    "duration": 6.88
  },
  {
    "text": "provable. So at this point, I guess I sort of agree with Penrose at that point. I go, okay,",
    "start": 7738.08,
    "duration": 10.48
  },
  {
    "text": "there's something beyond the notion of proof, beyond the notion of derivation that's going on",
    "start": 7748.56,
    "duration": 6.96
  },
  {
    "text": "here. There's the looking at analogies and understanding analogies that where we go,",
    "start": 7755.52,
    "duration": 8.0
  },
  {
    "text": "this sentence is clearly true. And it's also by its own statement, its own declaration,",
    "start": 7763.52,
    "duration": 4.88
  },
  {
    "text": "that it's not provable within this finite computational system.",
    "start": 7768.96,
    "duration": 4.72
  },
  {
    "text": "Penrose is fascinating. He thinks that our brains are physical systems. And he also thinks that our",
    "start": 7774.64,
    "duration": 6.56
  },
  {
    "text": "mental processes are generated by the brain, probably, but that our brains can do mathematics",
    "start": 7781.2,
    "duration": 6.24
  },
  {
    "text": "that go beyond the mathematics that computers can do. That is a very specific statement that",
    "start": 7787.44,
    "duration": 4.72
  },
  {
    "text": "is more concrete, I think, and specific than what you've said so far. And it leads him to",
    "start": 7792.16,
    "duration": 5.44
  },
  {
    "text": "a weird spot, which is quite lonely at the moment. But I find this nevertheless a very",
    "start": 7798.56,
    "duration": 5.36
  },
  {
    "text": "interesting argument to make. I'm afraid we will not be able to resolve it today because I have to",
    "start": 7803.92,
    "duration": 4.56
  },
  {
    "text": "drop now. But I found it very interesting to see that you are a Penroseist at the end of the day.",
    "start": 7808.48,
    "duration": 5.84
  },
  {
    "text": "Well, I don't like the microtubules theory, and I don't like the non-computational collapse of",
    "start": 7814.32,
    "duration": 6.16
  },
  {
    "text": "microtubules theory.",
    "start": 7820.48,
    "duration": 0.72
  },
  {
    "text": "He's not really to be blamed for this. I suspect that his reasoning is that since all known physics",
    "start": 7821.2,
    "duration": 5.04
  },
  {
    "text": "is computational, basically, it takes a state, and then there is a transition between the states.",
    "start": 7826.24,
    "duration": 6.4
  },
  {
    "text": "The resolution for what consciousness, where it comes from, if consciousness is enabling us to do",
    "start": 7833.2,
    "duration": 5.68
  },
  {
    "text": "things that computers cannot, needs to be in an unknown area of physics. And the unknown area of",
    "start": 7838.88,
    "duration": 5.28
  },
  {
    "text": "physics that's left, reasoning in the same way as Sherlock Holmes, if you actually exclude all the",
    "start": 7844.16,
    "duration": 5.6
  },
  {
    "text": "possibilities, the only remaining thing must be the truth, right? That's quantum gravity,",
    "start": 7849.76,
    "duration": 5.12
  },
  {
    "text": "because there is no generally accepted theory of quantum gravity. And then it just so happens that",
    "start": 7854.88,
    "duration": 5.2
  },
  {
    "text": "Hameroff has this beautiful psychedelic theory of how to get the microtubules to have non-local",
    "start": 7860.72,
    "duration": 6.96
  },
  {
    "text": "interactions that employ quantum gravities in a way that nobody really understands.",
    "start": 7867.68,
    "duration": 4.56
  },
  {
    "text": "And this might be in this corner. And so they became friends. But I don't think that Penrose",
    "start": 7872.96,
    "duration": 7.2
  },
  {
    "text": "theory is exactly the same thing as Hameroff theory.",
    "start": 7880.16,
    "duration": 2.56
  },
  {
    "text": "Right, right. And I'm not talking about that more general theory of consciousness. I'm just",
    "start": 7882.88,
    "duration": 4.24
  },
  {
    "text": "talking about his specific analysis of Gödel's incompleteness theorem and what it means for",
    "start": 7887.12,
    "duration": 3.84
  },
  {
    "text": "mathematics. Yes. And it's basically also something that Chomsky is a few into,",
    "start": 7890.96,
    "duration": 5.12
  },
  {
    "text": "in which leads Chomsky to mysterionism. So basically, they were confronted with the same",
    "start": 7896.08,
    "duration": 5.28
  },
  {
    "text": "insight or the same idea that they think that the human brains can do things that mathematics cannot,",
    "start": 7902.64,
    "duration": 4.88
  },
  {
    "text": "that mathematicians can make proofs that computers in principle cannot make, that they discover that",
    "start": 7907.92,
    "duration": 5.52
  },
  {
    "text": "certain statements are true that in a computable axiomatic system cannot be derived. And this was",
    "start": 7913.44,
    "duration": 5.2
  },
  {
    "text": "also what my question was pointing out, at how do you know that something is true there if you",
    "start": 7918.64,
    "duration": 5.04
  },
  {
    "text": "cannot go show me a sequence of steps that does it, right? And so Penrose thinks that",
    "start": 7923.68,
    "duration": 9.44
  },
  {
    "text": "there must be unknown physics. And Chomsky thinks it cannot be understood in principle,",
    "start": 7934.0,
    "duration": 5.76
  },
  {
    "text": "which might be the same thing at the end of the day. Right. I guess we will have to go. I'll just",
    "start": 7939.76,
    "duration": 6.72
  },
  {
    "text": "say our basic understanding of the axioms itself, then maybe one thing to, how do I understand the",
    "start": 7946.48,
    "duration": 7.84
  },
  {
    "text": "basic axioms that are the foundation of the computational system? Where does that understanding",
    "start": 7954.32,
    "duration": 4.48
  },
  {
    "text": "come from? Is that from within the computational system or does that escape the computational",
    "start": 7958.8,
    "duration": 4.88
  },
  {
    "text": "system? From my own perspective, it's the case that my mind is constructing a model of reality,",
    "start": 7963.68,
    "duration": 7.52
  },
  {
    "text": "the reality that I found myself to be in is something like a physics engine in which my",
    "start": 7971.2,
    "duration": 4.72
  },
  {
    "text": "own conscious self acts as a puppet, as a simulacrum that is being used to tell the story about",
    "start": 7975.92,
    "duration": 6.64
  },
  {
    "text": "an intelligent agent. And I don't see any limitations in my ability to make models that",
    "start": 7982.56,
    "duration": 5.52
  },
  {
    "text": "could produce such an agent that would find itself in this world and associate a set of",
    "start": 7988.08,
    "duration": 5.6
  },
  {
    "text": "valence precepts with a garlic and another one with sunlight. And that happens entirely through",
    "start": 7994.88,
    "duration": 8.32
  },
  {
    "text": "the relational nature of my unified model of the universe that is being derived by completely",
    "start": 8003.2,
    "duration": 5.36
  },
  {
    "text": "non-nefarious computation that are approximated in nervous systems. So I don't see where I currently",
    "start": 8008.56,
    "duration": 6.0
  },
  {
    "text": "stand that this doesn't work out. And I'm very sympathetic to when you don't see this,",
    "start": 8014.56,
    "duration": 7.36
  },
  {
    "text": "that it doesn't work out and that you have to think that you have to find the truth elsewhere.",
    "start": 8022.72,
    "duration": 4.72
  },
  {
    "text": "And it could be that I am going to change my mind in the future when I stumble on something that",
    "start": 8027.44,
    "duration": 4.08
  },
  {
    "text": "basically shows to me that what I'm intellectually trying doesn't work. So as far as it seems to work,",
    "start": 8031.52,
    "duration": 6.24
  },
  {
    "text": "and I appreciate that we have this difference in our perspectives because it's a very productive",
    "start": 8037.76,
    "duration": 5.12
  },
  {
    "text": "useful one to have. Absolutely. I've really appreciated the tenor of the conversation too,",
    "start": 8042.96,
    "duration": 4.96
  },
  {
    "text": "very much so. I would just say my last thought on this would be that what I would love to see",
    "start": 8047.92,
    "duration": 5.68
  },
  {
    "text": "from a computational system on consciousness is the association you just talked about between",
    "start": 8053.6,
    "duration": 5.04
  },
  {
    "text": "the computation and say the taste of garlic. Is it principled or is it arbitrary, that association?",
    "start": 8058.64,
    "duration": 6.72
  },
  {
    "text": "If it's arbitrary, then I'm not... Yes, it's not arbitrary.",
    "start": 8066.16,
    "duration": 3.44
  },
  {
    "text": "It's arbitrary? Because it is related to the valence of the taste receptors that you have.",
    "start": 8069.6,
    "duration": 5.68
  },
  {
    "text": "So it might be arbitrary in the sense that some people hate garlic and other people love garlic.",
    "start": 8075.28,
    "duration": 4.32
  },
  {
    "text": "So the garlic will taste different to them. This means they will have a different experience when",
    "start": 8079.6,
    "duration": 4.4
  },
  {
    "text": "they taste garlic because the relations of the taste of garlic will be different to the",
    "start": 8084.0,
    "duration": 4.24
  },
  {
    "text": "entire world model that they have than they are to other people. So basically the types of",
    "start": 8089.92,
    "duration": 4.8
  },
  {
    "text": "receptors that we have and the valence that they imply and the type of self-model that we have. So",
    "start": 8094.72,
    "duration": 5.04
  },
  {
    "text": "in which way has the mind constructed itself that is entangled with its universe around it? What is",
    "start": 8099.76,
    "duration": 5.36
  },
  {
    "text": "that boundary? What is the set points that are marking this boundary that keeps the self stable?",
    "start": 8105.12,
    "duration": 5.52
  },
  {
    "text": "This is going to shape and alter the perception. But I don't think that there is an intrinsic",
    "start": 8110.64,
    "duration": 4.88
  },
  {
    "text": "essence of perception beyond the relations that we establish between perceptual patterns",
    "start": 8115.52,
    "duration": 6.08
  },
  {
    "text": "and our models of reality. So there'll always be the question why should this computational",
    "start": 8121.6,
    "duration": 5.52
  },
  {
    "text": "process, independent of valence, be the taste of garlic? Why couldn't it have been the taste",
    "start": 8128.56,
    "duration": 6.24
  },
  {
    "text": "of chocolate? I would want a principled answer to why is this computational process necessarily",
    "start": 8134.8,
    "duration": 6.48
  },
  {
    "text": "the taste of garlic? Why isn't it the taste of chocolate? Because one is affiliated to garlic",
    "start": 8141.28,
    "duration": 5.68
  },
  {
    "text": "and the other one is associated to chocolate. But I'm talking about the conscious experience",
    "start": 8146.96,
    "duration": 5.92
  },
  {
    "text": "of the taste of... Oh well, chocolate is sweet for the most part and garlic is not. So this is one of",
    "start": 8152.88,
    "duration": 6.96
  },
  {
    "text": "the dimensions in which the features vary and sweetness is perceived as pleasant under some",
    "start": 8159.84,
    "duration": 5.6
  },
  {
    "text": "circumstances when you need certain types of nutrients and the soreness and bitterness and",
    "start": 8165.44,
    "duration": 5.2
  },
  {
    "text": "sharpness of garlic is associated with other things that you might need or dislike at certain moments.",
    "start": 8170.64,
    "duration": 5.28
  },
  {
    "text": "So the valence is crucial that you get and there are basically hundreds or thousands or",
    "start": 8175.92,
    "duration": 5.6
  },
  {
    "text": "tens of thousands of valence dimensions that specify how we perceive this texture of the",
    "start": 8182.08,
    "duration": 5.68
  },
  {
    "text": "pattern. But the resolution, the structure of the pattern and so on is entirely given by",
    "start": 8187.76,
    "duration": 5.76
  },
  {
    "text": "its relational nature. I don't think that there's an essence beyond the relations.",
    "start": 8193.52,
    "duration": 4.72
  },
  {
    "text": "It's like well this is the start of a whole other conversation.",
    "start": 8198.24,
    "duration": 2.24
  },
  {
    "text": "This is round one. Take care everyone. Thank you so much.",
    "start": 8200.48,
    "duration": 2.96
  },
  {
    "text": "Thank you too.",
    "start": 8204.4,
    "duration": 0.56
  },
  {
    "text": "Good to talk.",
    "start": 8205.68,
    "duration": 0.56
  },
  {
    "text": "I enjoyed this.",
    "start": 8206.24,
    "duration": 0.56
  },
  {
    "text": "Thank you very much.",
    "start": 8206.8,
    "duration": 0.56
  },
  {
    "text": "It was plenty of fun and the audience is all saying thank you as well. I think there were",
    "start": 8207.36,
    "duration": 4.24
  },
  {
    "text": "about a thousand people.",
    "start": 8211.6,
    "duration": 1.44
  },
  {
    "text": "Well thank you very much.",
    "start": 8213.04,
    "duration": 1.92
  },
  {
    "text": "Thank you, Joscha. Please send me the mp3 if you don't mind.",
    "start": 8216.88,
    "duration": 2.88
  },
  {
    "text": "And Don, I don't know if you still are recording yours.",
    "start": 8220.32,
    "duration": 2.88
  },
  {
    "text": "Bye bye.",
    "start": 8223.2,
    "duration": 0.48
  },
  {
    "text": "Okay.",
    "start": 8224.24,
    "duration": 0.32
  },
  {
    "text": "Bye bye.",
    "start": 8224.56,
    "duration": 0.56
  },
  {
    "text": "Take care.",
    "start": 8225.12,
    "duration": 0.4
  },
  {
    "text": "Thank you all. Thank you all. Thank you all so much for being here. It was plenty of fun.",
    "start": 8227.36,
    "duration": 4.08
  },
  {
    "text": "There's plenty to talk about for a round two whenever that occurs. Maybe toward the end of",
    "start": 8231.44,
    "duration": 4.96
  },
  {
    "text": "the summer or the middle of summer. We'll see people's willingness and ability.",
    "start": 8236.4,
    "duration": 5.36
  },
  {
    "text": "The podcast is now finished. If you'd like to support conversations like this, then do",
    "start": 8244.0,
    "duration": 4.24
  },
  {
    "text": "consider going to patreon.com slash c u r t j a i m u n g a l. That is Curt Jaimungal. It's",
    "start": 8248.24,
    "duration": 8.8
  },
  {
    "text": "support from the patrons and from the sponsors that allow me to do this full time. Every dollar",
    "start": 8257.04,
    "duration": 4.48
  },
  {
    "text": "helps tremendously. Thank you.",
    "start": 8261.52,
    "duration": 2.16
  }
]